Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x9a1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 18 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x35918): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x838ce): ../Core/Src/bmp280.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xb438f): C:/Embedded stuff/Marut_workspace_stm32/MARUT_FCU_Nucleo/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x662d3): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x3b5d4): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 6 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xc6de5): unsigned char
 <1><44>: Abbrev Number: 6 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x998ed): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xa80fd): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 6 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xc573d): short unsigned int
 <1><5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x11aa5): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x82ad3): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 6 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4db34): long unsigned int
 <1><78>: Abbrev Number: 6 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x5cb1e): long long int
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x2aa11): long long unsigned int
 <1><86>: Abbrev Number: 19 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x10fdf): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x3b5d6): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x107eff): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x11d9c5): uint32_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 48
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x65>
 <1><bd>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c3>   DW_AT_byte_size   : 24
    <c4>   DW_AT_decl_file   : 4
    <c4>   DW_AT_decl_line   : 362
    <c6>   DW_AT_decl_column : 9
    <c6>   DW_AT_sibling     : <0x112>
 <2><ca>: Abbrev Number: 7 (DW_TAG_member)
    <cb>   DW_AT_name        : CR
    <ce>   DW_AT_decl_file   : 4
    <ce>   DW_AT_decl_line   : 364
    <d0>   DW_AT_decl_column : 17
    <d0>   DW_AT_type        : <0xbd>
    <d4>   DW_AT_data_member_location: 0
 <2><d5>: Abbrev Number: 8 (DW_TAG_member)
    <d6>   DW_AT_name        : (indirect string, offset: 0x189b4): NDTR
    <da>   DW_AT_decl_file   : 4
    <da>   DW_AT_decl_line   : 365
    <dc>   DW_AT_decl_column : 17
    <dc>   DW_AT_type        : <0xbd>
    <e0>   DW_AT_data_member_location: 4
 <2><e1>: Abbrev Number: 7 (DW_TAG_member)
    <e2>   DW_AT_name        : PAR
    <e6>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 366
    <e8>   DW_AT_decl_column : 17
    <e8>   DW_AT_type        : <0xbd>
    <ec>   DW_AT_data_member_location: 8
 <2><ed>: Abbrev Number: 8 (DW_TAG_member)
    <ee>   DW_AT_name        : (indirect string, offset: 0x54417): M0AR
    <f2>   DW_AT_decl_file   : 4
    <f2>   DW_AT_decl_line   : 367
    <f4>   DW_AT_decl_column : 17
    <f4>   DW_AT_type        : <0xbd>
    <f8>   DW_AT_data_member_location: 12
 <2><f9>: Abbrev Number: 8 (DW_TAG_member)
    <fa>   DW_AT_name        : (indirect string, offset: 0x70fa6): M1AR
    <fe>   DW_AT_decl_file   : 4
    <fe>   DW_AT_decl_line   : 368
    <100>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xbd>
    <104>   DW_AT_data_member_location: 16
 <2><105>: Abbrev Number: 7 (DW_TAG_member)
    <106>   DW_AT_name        : FCR
    <10a>   DW_AT_decl_file   : 4
    <10a>   DW_AT_decl_line   : 369
    <10c>   DW_AT_decl_column : 17
    <10c>   DW_AT_type        : <0xbd>
    <110>   DW_AT_data_member_location: 20
 <2><111>: Abbrev Number: 0
 <1><112>: Abbrev Number: 17 (DW_TAG_typedef)
    <113>   DW_AT_name        : (indirect string, offset: 0x1985f): DMA_Stream_TypeDef
    <117>   DW_AT_decl_file   : 4
    <117>   DW_AT_decl_line   : 370
    <119>   DW_AT_decl_column : 3
    <119>   DW_AT_type        : <0xc2>
 <1><11d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <11e>   DW_AT_byte_size   : 40
    <11f>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 490
    <121>   DW_AT_decl_column : 9
    <121>   DW_AT_sibling     : <0x19d>
 <2><125>: Abbrev Number: 7 (DW_TAG_member)
    <126>   DW_AT_name        : CR1
    <12a>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 492
    <12c>   DW_AT_decl_column : 17
    <12c>   DW_AT_type        : <0xbd>
    <130>   DW_AT_data_member_location: 0
 <2><131>: Abbrev Number: 7 (DW_TAG_member)
    <132>   DW_AT_name        : CR2
    <136>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 493
    <138>   DW_AT_decl_column : 17
    <138>   DW_AT_type        : <0xbd>
    <13c>   DW_AT_data_member_location: 4
 <2><13d>: Abbrev Number: 8 (DW_TAG_member)
    <13e>   DW_AT_name        : (indirect string, offset: 0x1ec66): OAR1
    <142>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 494
    <144>   DW_AT_decl_column : 17
    <144>   DW_AT_type        : <0xbd>
    <148>   DW_AT_data_member_location: 8
 <2><149>: Abbrev Number: 8 (DW_TAG_member)
    <14a>   DW_AT_name        : (indirect string, offset: 0x3a363): OAR2
    <14e>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 495
    <150>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xbd>
    <154>   DW_AT_data_member_location: 12
 <2><155>: Abbrev Number: 7 (DW_TAG_member)
    <156>   DW_AT_name        : DR
    <159>   DW_AT_decl_file   : 4
    <159>   DW_AT_decl_line   : 496
    <15b>   DW_AT_decl_column : 17
    <15b>   DW_AT_type        : <0xbd>
    <15f>   DW_AT_data_member_location: 16
 <2><160>: Abbrev Number: 7 (DW_TAG_member)
    <161>   DW_AT_name        : SR1
    <165>   DW_AT_decl_file   : 4
    <165>   DW_AT_decl_line   : 497
    <167>   DW_AT_decl_column : 17
    <167>   DW_AT_type        : <0xbd>
    <16b>   DW_AT_data_member_location: 20
 <2><16c>: Abbrev Number: 7 (DW_TAG_member)
    <16d>   DW_AT_name        : SR2
    <171>   DW_AT_decl_file   : 4
    <171>   DW_AT_decl_line   : 498
    <173>   DW_AT_decl_column : 17
    <173>   DW_AT_type        : <0xbd>
    <177>   DW_AT_data_member_location: 24
 <2><178>: Abbrev Number: 7 (DW_TAG_member)
    <179>   DW_AT_name        : CCR
    <17d>   DW_AT_decl_file   : 4
    <17d>   DW_AT_decl_line   : 499
    <17f>   DW_AT_decl_column : 17
    <17f>   DW_AT_type        : <0xbd>
    <183>   DW_AT_data_member_location: 28
 <2><184>: Abbrev Number: 8 (DW_TAG_member)
    <185>   DW_AT_name        : (indirect string, offset: 0x689b1): TRISE
    <189>   DW_AT_decl_file   : 4
    <189>   DW_AT_decl_line   : 500
    <18b>   DW_AT_decl_column : 17
    <18b>   DW_AT_type        : <0xbd>
    <18f>   DW_AT_data_member_location: 32
 <2><190>: Abbrev Number: 8 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0x172a): FLTR
    <195>   DW_AT_decl_file   : 4
    <195>   DW_AT_decl_line   : 501
    <197>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xbd>
    <19b>   DW_AT_data_member_location: 36
 <2><19c>: Abbrev Number: 0
 <1><19d>: Abbrev Number: 17 (DW_TAG_typedef)
    <19e>   DW_AT_name        : (indirect string, offset: 0xa2303): I2C_TypeDef
    <1a2>   DW_AT_decl_file   : 4
    <1a2>   DW_AT_decl_line   : 502
    <1a4>   DW_AT_decl_column : 3
    <1a4>   DW_AT_type        : <0x11d>
 <1><1a8>: Abbrev Number: 6 (DW_TAG_base_type)
    <1a9>   DW_AT_byte_size   : 8
    <1aa>   DW_AT_encoding    : 4	(float)
    <1ab>   DW_AT_name        : (indirect string, offset: 0x4a012): long double
 <1><1af>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <1b0>   DW_AT_encoding    : 7	(unsigned)
    <1b0>   DW_AT_byte_size   : 1
    <1b0>   DW_AT_type        : <0x3d>
    <1b4>   DW_AT_decl_file   : 5
    <1b5>   DW_AT_decl_line   : 39
    <1b6>   DW_AT_decl_column : 1
    <1b6>   DW_AT_sibling     : <0x1d3>
 <2><1ba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x44d86): HAL_OK
    <1bf>   DW_AT_const_value : 0
 <2><1c0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x8055a): HAL_ERROR
    <1c5>   DW_AT_const_value : 1
 <2><1c6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x2404a): HAL_BUSY
    <1cb>   DW_AT_const_value : 2
 <2><1cc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x3bd1c): HAL_TIMEOUT
    <1d1>   DW_AT_const_value : 3
 <2><1d2>: Abbrev Number: 0
 <1><1d3>: Abbrev Number: 5 (DW_TAG_typedef)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x2b29): HAL_StatusTypeDef
    <1d8>   DW_AT_decl_file   : 5
    <1d9>   DW_AT_decl_line   : 44
    <1da>   DW_AT_decl_column : 3
    <1db>   DW_AT_type        : <0x1af>
 <1><1df>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <1e0>   DW_AT_encoding    : 7	(unsigned)
    <1e0>   DW_AT_byte_size   : 1
    <1e0>   DW_AT_type        : <0x3d>
    <1e4>   DW_AT_decl_file   : 5
    <1e5>   DW_AT_decl_line   : 50
    <1e6>   DW_AT_decl_column : 1
    <1e6>   DW_AT_sibling     : <0x1f7>
 <2><1ea>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x98615): HAL_UNLOCKED
    <1ef>   DW_AT_const_value : 0
 <2><1f0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1f1>   DW_AT_name        : (indirect string, offset: 0xcdf67): HAL_LOCKED
    <1f5>   DW_AT_const_value : 1
 <2><1f6>: Abbrev Number: 0
 <1><1f7>: Abbrev Number: 5 (DW_TAG_typedef)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x78e9b): HAL_LockTypeDef
    <1fc>   DW_AT_decl_file   : 5
    <1fd>   DW_AT_decl_line   : 53
    <1fe>   DW_AT_decl_column : 3
    <1ff>   DW_AT_type        : <0x1df>
 <1><203>: Abbrev Number: 13 (DW_TAG_structure_type)
    <204>   DW_AT_byte_size   : 48
    <205>   DW_AT_decl_file   : 6
    <206>   DW_AT_decl_line   : 48
    <207>   DW_AT_decl_column : 9
    <207>   DW_AT_sibling     : <0x2a8>
 <2><20b>: Abbrev Number: 1 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0xf39f4): Channel
    <210>   DW_AT_decl_file   : 6
    <211>   DW_AT_decl_line   : 50
    <212>   DW_AT_decl_column : 12
    <213>   DW_AT_type        : <0xb1>
    <217>   DW_AT_data_member_location: 0
 <2><218>: Abbrev Number: 1 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0x124a72): Direction
    <21d>   DW_AT_decl_file   : 6
    <21e>   DW_AT_decl_line   : 53
    <21f>   DW_AT_decl_column : 12
    <220>   DW_AT_type        : <0xb1>
    <224>   DW_AT_data_member_location: 4
 <2><225>: Abbrev Number: 1 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0xdf4d): PeriphInc
    <22a>   DW_AT_decl_file   : 6
    <22b>   DW_AT_decl_line   : 57
    <22c>   DW_AT_decl_column : 12
    <22d>   DW_AT_type        : <0xb1>
    <231>   DW_AT_data_member_location: 8
 <2><232>: Abbrev Number: 1 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0x20923): MemInc
    <237>   DW_AT_decl_file   : 6
    <238>   DW_AT_decl_line   : 60
    <239>   DW_AT_decl_column : 12
    <23a>   DW_AT_type        : <0xb1>
    <23e>   DW_AT_data_member_location: 12
 <2><23f>: Abbrev Number: 1 (DW_TAG_member)
    <240>   DW_AT_name        : (indirect string, offset: 0x65343): PeriphDataAlignment
    <244>   DW_AT_decl_file   : 6
    <245>   DW_AT_decl_line   : 63
    <246>   DW_AT_decl_column : 12
    <247>   DW_AT_type        : <0xb1>
    <24b>   DW_AT_data_member_location: 16
 <2><24c>: Abbrev Number: 1 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0xb9ef4): MemDataAlignment
    <251>   DW_AT_decl_file   : 6
    <252>   DW_AT_decl_line   : 66
    <253>   DW_AT_decl_column : 12
    <254>   DW_AT_type        : <0xb1>
    <258>   DW_AT_data_member_location: 20
 <2><259>: Abbrev Number: 1 (DW_TAG_member)
    <25a>   DW_AT_name        : (indirect string, offset: 0x1258c3): Mode
    <25e>   DW_AT_decl_file   : 6
    <25f>   DW_AT_decl_line   : 69
    <260>   DW_AT_decl_column : 12
    <261>   DW_AT_type        : <0xb1>
    <265>   DW_AT_data_member_location: 24
 <2><266>: Abbrev Number: 1 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x123d73): Priority
    <26b>   DW_AT_decl_file   : 6
    <26c>   DW_AT_decl_line   : 74
    <26d>   DW_AT_decl_column : 12
    <26e>   DW_AT_type        : <0xb1>
    <272>   DW_AT_data_member_location: 28
 <2><273>: Abbrev Number: 1 (DW_TAG_member)
    <274>   DW_AT_name        : (indirect string, offset: 0x57828): FIFOMode
    <278>   DW_AT_decl_file   : 6
    <279>   DW_AT_decl_line   : 77
    <27a>   DW_AT_decl_column : 12
    <27b>   DW_AT_type        : <0xb1>
    <27f>   DW_AT_data_member_location: 32
 <2><280>: Abbrev Number: 1 (DW_TAG_member)
    <281>   DW_AT_name        : (indirect string, offset: 0x9ccfc): FIFOThreshold
    <285>   DW_AT_decl_file   : 6
    <286>   DW_AT_decl_line   : 82
    <287>   DW_AT_decl_column : 12
    <288>   DW_AT_type        : <0xb1>
    <28c>   DW_AT_data_member_location: 36
 <2><28d>: Abbrev Number: 1 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x9ae26): MemBurst
    <292>   DW_AT_decl_file   : 6
    <293>   DW_AT_decl_line   : 85
    <294>   DW_AT_decl_column : 12
    <295>   DW_AT_type        : <0xb1>
    <299>   DW_AT_data_member_location: 40
 <2><29a>: Abbrev Number: 1 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0x45c91): PeriphBurst
    <29f>   DW_AT_decl_file   : 6
    <2a0>   DW_AT_decl_line   : 91
    <2a1>   DW_AT_decl_column : 12
    <2a2>   DW_AT_type        : <0xb1>
    <2a6>   DW_AT_data_member_location: 44
 <2><2a7>: Abbrev Number: 0
 <1><2a8>: Abbrev Number: 5 (DW_TAG_typedef)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x36f56): DMA_InitTypeDef
    <2ad>   DW_AT_decl_file   : 6
    <2ae>   DW_AT_decl_line   : 96
    <2af>   DW_AT_decl_column : 2
    <2b0>   DW_AT_type        : <0x203>
 <1><2b4>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <2b5>   DW_AT_encoding    : 7	(unsigned)
    <2b5>   DW_AT_byte_size   : 1
    <2b5>   DW_AT_type        : <0x3d>
    <2b9>   DW_AT_decl_file   : 6
    <2ba>   DW_AT_decl_line   : 103
    <2bb>   DW_AT_decl_column : 1
    <2bb>   DW_AT_sibling     : <0x2e4>
 <2><2bf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x99c6c): HAL_DMA_STATE_RESET
    <2c4>   DW_AT_const_value : 0
 <2><2c5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x3826a): HAL_DMA_STATE_READY
    <2ca>   DW_AT_const_value : 1
 <2><2cb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x8e0a6): HAL_DMA_STATE_BUSY
    <2d0>   DW_AT_const_value : 2
 <2><2d1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2d2>   DW_AT_name        : (indirect string, offset: 0xcace8): HAL_DMA_STATE_TIMEOUT
    <2d6>   DW_AT_const_value : 3
 <2><2d7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x9c666): HAL_DMA_STATE_ERROR
    <2dc>   DW_AT_const_value : 4
 <2><2dd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2de>   DW_AT_name        : (indirect string, offset: 0x2e755): HAL_DMA_STATE_ABORT
    <2e2>   DW_AT_const_value : 5
 <2><2e3>: Abbrev Number: 0
 <1><2e4>: Abbrev Number: 5 (DW_TAG_typedef)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x70a0e): HAL_DMA_StateTypeDef
    <2e9>   DW_AT_decl_file   : 6
    <2ea>   DW_AT_decl_line   : 110
    <2eb>   DW_AT_decl_column : 2
    <2ec>   DW_AT_type        : <0x2b4>
 <1><2f0>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <2f1>   DW_AT_type        : <0x2e4>
 <1><2f5>: Abbrev Number: 20 (DW_TAG_structure_type)
    <2f6>   DW_AT_name        : (indirect string, offset: 0xaf2ef): __DMA_HandleTypeDef
    <2fa>   DW_AT_byte_size   : 96
    <2fb>   DW_AT_decl_file   : 6
    <2fc>   DW_AT_decl_line   : 138
    <2fd>   DW_AT_decl_column : 16
    <2fe>   DW_AT_sibling     : <0x3b9>
 <2><302>: Abbrev Number: 1 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0xc71f6): Instance
    <307>   DW_AT_decl_file   : 6
    <308>   DW_AT_decl_line   : 140
    <309>   DW_AT_decl_column : 31
    <30a>   DW_AT_type        : <0x3b9>
    <30e>   DW_AT_data_member_location: 0
 <2><30f>: Abbrev Number: 1 (DW_TAG_member)
    <310>   DW_AT_name        : (indirect string, offset: 0x1251f4): Init
    <314>   DW_AT_decl_file   : 6
    <315>   DW_AT_decl_line   : 142
    <316>   DW_AT_decl_column : 30
    <317>   DW_AT_type        : <0x2a8>
    <31b>   DW_AT_data_member_location: 4
 <2><31c>: Abbrev Number: 1 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x92777): Lock
    <321>   DW_AT_decl_file   : 6
    <322>   DW_AT_decl_line   : 144
    <323>   DW_AT_decl_column : 30
    <324>   DW_AT_type        : <0x1f7>
    <328>   DW_AT_data_member_location: 52
 <2><329>: Abbrev Number: 1 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0x10540d): State
    <32e>   DW_AT_decl_file   : 6
    <32f>   DW_AT_decl_line   : 146
    <330>   DW_AT_decl_column : 30
    <331>   DW_AT_type        : <0x2f0>
    <335>   DW_AT_data_member_location: 53
 <2><336>: Abbrev Number: 1 (DW_TAG_member)
    <337>   DW_AT_name        : (indirect string, offset: 0xc3e8e): Parent
    <33b>   DW_AT_decl_file   : 6
    <33c>   DW_AT_decl_line   : 148
    <33d>   DW_AT_decl_column : 31
    <33e>   DW_AT_type        : <0x3be>
    <342>   DW_AT_data_member_location: 56
 <2><343>: Abbrev Number: 1 (DW_TAG_member)
    <344>   DW_AT_name        : (indirect string, offset: 0xcd424): XferCpltCallback
    <348>   DW_AT_decl_file   : 6
    <349>   DW_AT_decl_line   : 150
    <34a>   DW_AT_decl_column : 33
    <34b>   DW_AT_type        : <0x3d0>
    <34f>   DW_AT_data_member_location: 60
 <2><350>: Abbrev Number: 1 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0xa022c): XferHalfCpltCallback
    <355>   DW_AT_decl_file   : 6
    <356>   DW_AT_decl_line   : 152
    <357>   DW_AT_decl_column : 33
    <358>   DW_AT_type        : <0x3d0>
    <35c>   DW_AT_data_member_location: 64
 <2><35d>: Abbrev Number: 1 (DW_TAG_member)
    <35e>   DW_AT_name        : (indirect string, offset: 0x783b6): XferM1CpltCallback
    <362>   DW_AT_decl_file   : 6
    <363>   DW_AT_decl_line   : 154
    <364>   DW_AT_decl_column : 33
    <365>   DW_AT_type        : <0x3d0>
    <369>   DW_AT_data_member_location: 68
 <2><36a>: Abbrev Number: 1 (DW_TAG_member)
    <36b>   DW_AT_name        : (indirect string, offset: 0x61c87): XferM1HalfCpltCallback
    <36f>   DW_AT_decl_file   : 6
    <370>   DW_AT_decl_line   : 156
    <371>   DW_AT_decl_column : 33
    <372>   DW_AT_type        : <0x3d0>
    <376>   DW_AT_data_member_location: 72
 <2><377>: Abbrev Number: 1 (DW_TAG_member)
    <378>   DW_AT_name        : (indirect string, offset: 0x1dd59): XferErrorCallback
    <37c>   DW_AT_decl_file   : 6
    <37d>   DW_AT_decl_line   : 158
    <37e>   DW_AT_decl_column : 33
    <37f>   DW_AT_type        : <0x3d0>
    <383>   DW_AT_data_member_location: 76
 <2><384>: Abbrev Number: 1 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0xc0571): XferAbortCallback
    <389>   DW_AT_decl_file   : 6
    <38a>   DW_AT_decl_line   : 160
    <38b>   DW_AT_decl_column : 33
    <38c>   DW_AT_type        : <0x3d0>
    <390>   DW_AT_data_member_location: 80
 <2><391>: Abbrev Number: 1 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0xc95e7): ErrorCode
    <396>   DW_AT_decl_file   : 6
    <397>   DW_AT_decl_line   : 162
    <398>   DW_AT_decl_column : 30
    <399>   DW_AT_type        : <0xbd>
    <39d>   DW_AT_data_member_location: 84
 <2><39e>: Abbrev Number: 1 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0x9bbe3): StreamBaseAddress
    <3a3>   DW_AT_decl_file   : 6
    <3a4>   DW_AT_decl_line   : 164
    <3a5>   DW_AT_decl_column : 30
    <3a6>   DW_AT_type        : <0xb1>
    <3aa>   DW_AT_data_member_location: 88
 <2><3ab>: Abbrev Number: 1 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0xad0c5): StreamIndex
    <3b0>   DW_AT_decl_file   : 6
    <3b1>   DW_AT_decl_line   : 166
    <3b2>   DW_AT_decl_column : 30
    <3b3>   DW_AT_type        : <0xb1>
    <3b7>   DW_AT_data_member_location: 92
 <2><3b8>: Abbrev Number: 0
 <1><3b9>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3ba>   DW_AT_byte_size   : 4
    <3ba>   DW_AT_type        : <0x112>
 <1><3be>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <3bf>   DW_AT_byte_size   : 4
 <1><3c0>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <3c1>   DW_AT_prototyped  : 1
    <3c1>   DW_AT_sibling     : <0x3cb>
 <2><3c5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3c6>   DW_AT_type        : <0x3cb>
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3cc>   DW_AT_byte_size   : 4
    <3cc>   DW_AT_type        : <0x2f5>
 <1><3d0>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3d1>   DW_AT_byte_size   : 4
    <3d1>   DW_AT_type        : <0x3c0>
 <1><3d5>: Abbrev Number: 5 (DW_TAG_typedef)
    <3d6>   DW_AT_name        : (indirect string, offset: 0xaf2f1): DMA_HandleTypeDef
    <3da>   DW_AT_decl_file   : 6
    <3db>   DW_AT_decl_line   : 168
    <3dc>   DW_AT_decl_column : 2
    <3dd>   DW_AT_type        : <0x2f5>
 <1><3e1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <3e2>   DW_AT_byte_size   : 32
    <3e3>   DW_AT_decl_file   : 7
    <3e4>   DW_AT_decl_line   : 47
    <3e5>   DW_AT_decl_column : 9
    <3e5>   DW_AT_sibling     : <0x452>
 <2><3e9>: Abbrev Number: 1 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x41dec): ClockSpeed
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 49
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xb1>
    <3f5>   DW_AT_data_member_location: 0
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x7c7f1): DutyCycle
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 52
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xb1>
    <402>   DW_AT_data_member_location: 4
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0x49524): OwnAddress1
    <408>   DW_AT_decl_file   : 7
    <409>   DW_AT_decl_line   : 55
    <40a>   DW_AT_decl_column : 12
    <40b>   DW_AT_type        : <0xb1>
    <40f>   DW_AT_data_member_location: 8
 <2><410>: Abbrev Number: 1 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x56120): AddressingMode
    <415>   DW_AT_decl_file   : 7
    <416>   DW_AT_decl_line   : 58
    <417>   DW_AT_decl_column : 12
    <418>   DW_AT_type        : <0xb1>
    <41c>   DW_AT_data_member_location: 12
 <2><41d>: Abbrev Number: 1 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0x939c5): DualAddressMode
    <422>   DW_AT_decl_file   : 7
    <423>   DW_AT_decl_line   : 61
    <424>   DW_AT_decl_column : 12
    <425>   DW_AT_type        : <0xb1>
    <429>   DW_AT_data_member_location: 16
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x49530): OwnAddress2
    <42f>   DW_AT_decl_file   : 7
    <430>   DW_AT_decl_line   : 64
    <431>   DW_AT_decl_column : 12
    <432>   DW_AT_type        : <0xb1>
    <436>   DW_AT_data_member_location: 20
 <2><437>: Abbrev Number: 1 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x21a34): GeneralCallMode
    <43c>   DW_AT_decl_file   : 7
    <43d>   DW_AT_decl_line   : 67
    <43e>   DW_AT_decl_column : 12
    <43f>   DW_AT_type        : <0xb1>
    <443>   DW_AT_data_member_location: 24
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x3ed40): NoStretchMode
    <449>   DW_AT_decl_file   : 7
    <44a>   DW_AT_decl_line   : 70
    <44b>   DW_AT_decl_column : 12
    <44c>   DW_AT_type        : <0xb1>
    <450>   DW_AT_data_member_location: 28
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 5 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0xa950a): I2C_InitTypeDef
    <457>   DW_AT_decl_file   : 7
    <458>   DW_AT_decl_line   : 73
    <459>   DW_AT_decl_column : 3
    <45a>   DW_AT_type        : <0x3e1>
 <1><45e>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <45f>   DW_AT_encoding    : 7	(unsigned)
    <45f>   DW_AT_byte_size   : 1
    <45f>   DW_AT_type        : <0x3d>
    <463>   DW_AT_decl_file   : 7
    <464>   DW_AT_decl_line   : 107
    <465>   DW_AT_decl_column : 1
    <465>   DW_AT_sibling     : <0x4ac>
 <2><469>: Abbrev Number: 3 (DW_TAG_enumerator)
    <46a>   DW_AT_name        : (indirect string, offset: 0xa35c0): HAL_I2C_STATE_RESET
    <46e>   DW_AT_const_value : 0
 <2><46f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <470>   DW_AT_name        : (indirect string, offset: 0x423a0): HAL_I2C_STATE_READY
    <474>   DW_AT_const_value : 32
 <2><475>: Abbrev Number: 3 (DW_TAG_enumerator)
    <476>   DW_AT_name        : (indirect string, offset: 0x3b2a4): HAL_I2C_STATE_BUSY
    <47a>   DW_AT_const_value : 36
 <2><47b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <47c>   DW_AT_name        : (indirect string, offset: 0x86039): HAL_I2C_STATE_BUSY_TX
    <480>   DW_AT_const_value : 33
 <2><481>: Abbrev Number: 3 (DW_TAG_enumerator)
    <482>   DW_AT_name        : (indirect string, offset: 0x485cd): HAL_I2C_STATE_BUSY_RX
    <486>   DW_AT_const_value : 34
 <2><487>: Abbrev Number: 3 (DW_TAG_enumerator)
    <488>   DW_AT_name        : (indirect string, offset: 0x5053e): HAL_I2C_STATE_LISTEN
    <48c>   DW_AT_const_value : 40
 <2><48d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <48e>   DW_AT_name        : (indirect string, offset: 0x3161a): HAL_I2C_STATE_BUSY_TX_LISTEN
    <492>   DW_AT_const_value : 41
 <2><493>: Abbrev Number: 3 (DW_TAG_enumerator)
    <494>   DW_AT_name        : (indirect string, offset: 0x8d591): HAL_I2C_STATE_BUSY_RX_LISTEN
    <498>   DW_AT_const_value : 42
 <2><499>: Abbrev Number: 3 (DW_TAG_enumerator)
    <49a>   DW_AT_name        : (indirect string, offset: 0x38763): HAL_I2C_STATE_ABORT
    <49e>   DW_AT_const_value : 96
 <2><49f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xabacf): HAL_I2C_STATE_TIMEOUT
    <4a4>   DW_AT_const_value : 160
 <2><4a5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4a6>   DW_AT_name        : (indirect string, offset: 0xbaaf4): HAL_I2C_STATE_ERROR
    <4aa>   DW_AT_const_value : 224
 <2><4ab>: Abbrev Number: 0
 <1><4ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x22807): HAL_I2C_StateTypeDef
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 122
    <4b3>   DW_AT_decl_column : 3
    <4b4>   DW_AT_type        : <0x45e>
 <1><4b8>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <4b9>   DW_AT_type        : <0x4ac>
 <1><4bd>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <4be>   DW_AT_encoding    : 7	(unsigned)
    <4be>   DW_AT_byte_size   : 1
    <4be>   DW_AT_type        : <0x3d>
    <4c2>   DW_AT_decl_file   : 7
    <4c3>   DW_AT_decl_line   : 147
    <4c4>   DW_AT_decl_column : 1
    <4c4>   DW_AT_sibling     : <0x4e1>
 <2><4c8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x3584c): HAL_I2C_MODE_NONE
    <4cd>   DW_AT_const_value : 0
 <2><4ce>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x40dd): HAL_I2C_MODE_MASTER
    <4d3>   DW_AT_const_value : 16
 <2><4d4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4d5>   DW_AT_name        : (indirect string, offset: 0x65bc3): HAL_I2C_MODE_SLAVE
    <4d9>   DW_AT_const_value : 32
 <2><4da>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4db>   DW_AT_name        : (indirect string, offset: 0x40b00): HAL_I2C_MODE_MEM
    <4df>   DW_AT_const_value : 64
 <2><4e0>: Abbrev Number: 0
 <1><4e1>: Abbrev Number: 5 (DW_TAG_typedef)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x6277f): HAL_I2C_ModeTypeDef
    <4e6>   DW_AT_decl_file   : 7
    <4e7>   DW_AT_decl_line   : 153
    <4e8>   DW_AT_decl_column : 3
    <4e9>   DW_AT_type        : <0x4bd>
 <1><4ed>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <4ee>   DW_AT_type        : <0x4e1>
 <1><4f2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <4f3>   DW_AT_byte_size   : 84
    <4f4>   DW_AT_decl_file   : 7
    <4f5>   DW_AT_decl_line   : 187
    <4f6>   DW_AT_decl_column : 9
    <4f6>   DW_AT_sibling     : <0x5d8>
 <2><4fa>: Abbrev Number: 1 (DW_TAG_member)
    <4fb>   DW_AT_name        : (indirect string, offset: 0xc71f6): Instance
    <4ff>   DW_AT_decl_file   : 7
    <500>   DW_AT_decl_line   : 190
    <501>   DW_AT_decl_column : 31
    <502>   DW_AT_type        : <0x5d8>
    <506>   DW_AT_data_member_location: 0
 <2><507>: Abbrev Number: 1 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x1251f4): Init
    <50c>   DW_AT_decl_file   : 7
    <50d>   DW_AT_decl_line   : 192
    <50e>   DW_AT_decl_column : 30
    <50f>   DW_AT_type        : <0x452>
    <513>   DW_AT_data_member_location: 4
 <2><514>: Abbrev Number: 1 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0x9c881): pBuffPtr
    <519>   DW_AT_decl_file   : 7
    <51a>   DW_AT_decl_line   : 194
    <51b>   DW_AT_decl_column : 31
    <51c>   DW_AT_type        : <0x5dd>
    <520>   DW_AT_data_member_location: 36
 <2><521>: Abbrev Number: 1 (DW_TAG_member)
    <522>   DW_AT_name        : (indirect string, offset: 0xf249c): XferSize
    <526>   DW_AT_decl_file   : 7
    <527>   DW_AT_decl_line   : 196
    <528>   DW_AT_decl_column : 30
    <529>   DW_AT_type        : <0xa0>
    <52d>   DW_AT_data_member_location: 40
 <2><52e>: Abbrev Number: 1 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0xfd7c0): XferCount
    <533>   DW_AT_decl_file   : 7
    <534>   DW_AT_decl_line   : 198
    <535>   DW_AT_decl_column : 30
    <536>   DW_AT_type        : <0xac>
    <53a>   DW_AT_data_member_location: 42
 <2><53b>: Abbrev Number: 1 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0x124595): XferOptions
    <540>   DW_AT_decl_file   : 7
    <541>   DW_AT_decl_line   : 200
    <542>   DW_AT_decl_column : 30
    <543>   DW_AT_type        : <0xbd>
    <547>   DW_AT_data_member_location: 44
 <2><548>: Abbrev Number: 1 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0x46042): PreviousState
    <54d>   DW_AT_decl_file   : 7
    <54e>   DW_AT_decl_line   : 202
    <54f>   DW_AT_decl_column : 30
    <550>   DW_AT_type        : <0xbd>
    <554>   DW_AT_data_member_location: 48
 <2><555>: Abbrev Number: 1 (DW_TAG_member)
    <556>   DW_AT_name        : (indirect string, offset: 0xc8a2a): hdmatx
    <55a>   DW_AT_decl_file   : 7
    <55b>   DW_AT_decl_line   : 205
    <55c>   DW_AT_decl_column : 31
    <55d>   DW_AT_type        : <0x5e2>
    <561>   DW_AT_data_member_location: 52
 <2><562>: Abbrev Number: 1 (DW_TAG_member)
    <563>   DW_AT_name        : (indirect string, offset: 0xc7d80): hdmarx
    <567>   DW_AT_decl_file   : 7
    <568>   DW_AT_decl_line   : 207
    <569>   DW_AT_decl_column : 31
    <56a>   DW_AT_type        : <0x5e2>
    <56e>   DW_AT_data_member_location: 56
 <2><56f>: Abbrev Number: 1 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x92777): Lock
    <574>   DW_AT_decl_file   : 7
    <575>   DW_AT_decl_line   : 209
    <576>   DW_AT_decl_column : 30
    <577>   DW_AT_type        : <0x1f7>
    <57b>   DW_AT_data_member_location: 60
 <2><57c>: Abbrev Number: 1 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0x10540d): State
    <581>   DW_AT_decl_file   : 7
    <582>   DW_AT_decl_line   : 211
    <583>   DW_AT_decl_column : 30
    <584>   DW_AT_type        : <0x4b8>
    <588>   DW_AT_data_member_location: 61
 <2><589>: Abbrev Number: 1 (DW_TAG_member)
    <58a>   DW_AT_name        : (indirect string, offset: 0x1258c3): Mode
    <58e>   DW_AT_decl_file   : 7
    <58f>   DW_AT_decl_line   : 213
    <590>   DW_AT_decl_column : 30
    <591>   DW_AT_type        : <0x4ed>
    <595>   DW_AT_data_member_location: 62
 <2><596>: Abbrev Number: 1 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0xc95e7): ErrorCode
    <59b>   DW_AT_decl_file   : 7
    <59c>   DW_AT_decl_line   : 215
    <59d>   DW_AT_decl_column : 30
    <59e>   DW_AT_type        : <0xbd>
    <5a2>   DW_AT_data_member_location: 64
 <2><5a3>: Abbrev Number: 1 (DW_TAG_member)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x8502c): Devaddress
    <5a8>   DW_AT_decl_file   : 7
    <5a9>   DW_AT_decl_line   : 217
    <5aa>   DW_AT_decl_column : 30
    <5ab>   DW_AT_type        : <0xbd>
    <5af>   DW_AT_data_member_location: 68
 <2><5b0>: Abbrev Number: 1 (DW_TAG_member)
    <5b1>   DW_AT_name        : (indirect string, offset: 0x76985): Memaddress
    <5b5>   DW_AT_decl_file   : 7
    <5b6>   DW_AT_decl_line   : 219
    <5b7>   DW_AT_decl_column : 30
    <5b8>   DW_AT_type        : <0xbd>
    <5bc>   DW_AT_data_member_location: 72
 <2><5bd>: Abbrev Number: 1 (DW_TAG_member)
    <5be>   DW_AT_name        : (indirect string, offset: 0x60135): MemaddSize
    <5c2>   DW_AT_decl_file   : 7
    <5c3>   DW_AT_decl_line   : 221
    <5c4>   DW_AT_decl_column : 30
    <5c5>   DW_AT_type        : <0xbd>
    <5c9>   DW_AT_data_member_location: 76
 <2><5ca>: Abbrev Number: 1 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0xf7e6): EventCount
    <5cf>   DW_AT_decl_file   : 7
    <5d0>   DW_AT_decl_line   : 223
    <5d1>   DW_AT_decl_column : 30
    <5d2>   DW_AT_type        : <0xbd>
    <5d6>   DW_AT_data_member_location: 80
 <2><5d7>: Abbrev Number: 0
 <1><5d8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5d9>   DW_AT_byte_size   : 4
    <5d9>   DW_AT_type        : <0x19d>
 <1><5dd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5de>   DW_AT_byte_size   : 4
    <5de>   DW_AT_type        : <0x94>
 <1><5e2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <5e3>   DW_AT_byte_size   : 4
    <5e3>   DW_AT_type        : <0x3d5>
 <1><5e7>: Abbrev Number: 5 (DW_TAG_typedef)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x45b13): I2C_HandleTypeDef
    <5ec>   DW_AT_decl_file   : 7
    <5ed>   DW_AT_decl_line   : 243
    <5ee>   DW_AT_decl_column : 3
    <5ef>   DW_AT_type        : <0x4f2>
 <1><5f3>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f4>   DW_AT_byte_size   : 1
    <5f5>   DW_AT_encoding    : 8	(unsigned char)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xe490e): char
 <1><5fa>: Abbrev Number: 6 (DW_TAG_base_type)
    <5fb>   DW_AT_byte_size   : 4
    <5fc>   DW_AT_encoding    : 4	(float)
    <5fd>   DW_AT_name        : (indirect string, offset: 0xb0b3b): float
 <1><601>: Abbrev Number: 6 (DW_TAG_base_type)
    <602>   DW_AT_byte_size   : 8
    <603>   DW_AT_encoding    : 4	(float)
    <604>   DW_AT_name        : (indirect string, offset: 0xd87ab): double
 <1><608>: Abbrev Number: 23 (DW_TAG_variable)
    <609>   DW_AT_name        : (indirect string, offset: 0x5a71): hi2c1
    <60d>   DW_AT_decl_file   : 1
    <60e>   DW_AT_decl_line   : 10
    <60f>   DW_AT_decl_column : 26
    <610>   DW_AT_type        : <0x5e7>
    <614>   DW_AT_external    : 1
    <614>   DW_AT_declaration : 1
 <1><614>: Abbrev Number: 14 (DW_TAG_subprogram)
    <615>   DW_AT_external    : 1
    <615>   DW_AT_name        : (indirect string, offset: 0x7abf3): powf
    <619>   DW_AT_decl_file   : 8
    <61a>   DW_AT_decl_line   : 394
    <61c>   DW_AT_decl_column : 14
    <61d>   DW_AT_prototyped  : 1
    <61d>   DW_AT_type        : <0x5fa>
    <621>   DW_AT_declaration : 1
    <621>   DW_AT_sibling     : <0x630>
 <2><625>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <626>   DW_AT_type        : <0x5fa>
 <2><62a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <62b>   DW_AT_type        : <0x5fa>
 <2><62f>: Abbrev Number: 0
 <1><630>: Abbrev Number: 14 (DW_TAG_subprogram)
    <631>   DW_AT_external    : 1
    <631>   DW_AT_name        : (indirect string, offset: 0x49203): HAL_I2C_Mem_Read
    <635>   DW_AT_decl_file   : 7
    <636>   DW_AT_decl_line   : 571
    <638>   DW_AT_decl_column : 19
    <639>   DW_AT_prototyped  : 1
    <639>   DW_AT_type        : <0x1d3>
    <63d>   DW_AT_declaration : 1
    <63d>   DW_AT_sibling     : <0x665>
 <2><641>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <642>   DW_AT_type        : <0x665>
 <2><646>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <647>   DW_AT_type        : <0xa0>
 <2><64b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <64c>   DW_AT_type        : <0xa0>
 <2><650>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <651>   DW_AT_type        : <0xa0>
 <2><655>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <656>   DW_AT_type        : <0x5dd>
 <2><65a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <65b>   DW_AT_type        : <0xa0>
 <2><65f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <660>   DW_AT_type        : <0xb1>
 <2><664>: Abbrev Number: 0
 <1><665>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <666>   DW_AT_byte_size   : 4
    <666>   DW_AT_type        : <0x5e7>
 <1><66a>: Abbrev Number: 14 (DW_TAG_subprogram)
    <66b>   DW_AT_external    : 1
    <66b>   DW_AT_name        : (indirect string, offset: 0x17524): HAL_I2C_Mem_Write
    <66f>   DW_AT_decl_file   : 7
    <670>   DW_AT_decl_line   : 570
    <672>   DW_AT_decl_column : 19
    <673>   DW_AT_prototyped  : 1
    <673>   DW_AT_type        : <0x1d3>
    <677>   DW_AT_declaration : 1
    <677>   DW_AT_sibling     : <0x69f>
 <2><67b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <67c>   DW_AT_type        : <0x665>
 <2><680>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <681>   DW_AT_type        : <0xa0>
 <2><685>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <686>   DW_AT_type        : <0xa0>
 <2><68a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <68b>   DW_AT_type        : <0xa0>
 <2><68f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <690>   DW_AT_type        : <0x5dd>
 <2><694>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <695>   DW_AT_type        : <0xa0>
 <2><699>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <69a>   DW_AT_type        : <0xb1>
 <2><69e>: Abbrev Number: 0
 <1><69f>: Abbrev Number: 12 (DW_TAG_subprogram)
    <6a0>   DW_AT_external    : 1
    <6a0>   DW_AT_name        : (indirect string, offset: 0x1f1ae): altitude_calc
    <6a4>   DW_AT_decl_file   : 1
    <6a4>   DW_AT_decl_line   : 129
    <6a5>   DW_AT_decl_column : 7
    <6a6>   DW_AT_prototyped  : 1
    <6a6>   DW_AT_type        : <0x5fa>
    <6aa>   DW_AT_low_pc      : 0x80017d8
    <6ae>   DW_AT_high_pc     : 0xa8
    <6b2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6b4>   DW_AT_call_all_tail_calls: 1
    <6b4>   DW_AT_sibling     : <0x6f4>
 <2><6b8>: Abbrev Number: 2 (DW_TAG_variable)
    <6b9>   DW_AT_name        : (indirect string, offset: 0xb10b1): refPressure
    <6bd>   DW_AT_decl_file   : 1
    <6bd>   DW_AT_decl_line   : 130
    <6be>   DW_AT_decl_column : 15
    <6bf>   DW_AT_type        : <0x5fa>
    <6c3>   DW_AT_location    : 5 byte block: 3 f4 1 0 20 	(DW_OP_addr: 200001f4)
 <2><6c9>: Abbrev Number: 2 (DW_TAG_variable)
    <6ca>   DW_AT_name        : (indirect string, offset: 0x964f2): pressure_hPa
    <6ce>   DW_AT_decl_file   : 1
    <6ce>   DW_AT_decl_line   : 131
    <6cf>   DW_AT_decl_column : 8
    <6d0>   DW_AT_type        : <0x5fa>
    <6d4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><6d7>: Abbrev Number: 2 (DW_TAG_variable)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x29838): tempC
    <6dc>   DW_AT_decl_file   : 1
    <6dc>   DW_AT_decl_line   : 132
    <6dd>   DW_AT_decl_column : 8
    <6de>   DW_AT_type        : <0x5fa>
    <6e2>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><6e5>: Abbrev Number: 2 (DW_TAG_variable)
    <6e6>   DW_AT_name        : (indirect string, offset: 0xda98): altitude
    <6ea>   DW_AT_decl_file   : 1
    <6ea>   DW_AT_decl_line   : 138
    <6eb>   DW_AT_decl_column : 8
    <6ec>   DW_AT_type        : <0x5fa>
    <6f0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6f3>: Abbrev Number: 0
 <1><6f4>: Abbrev Number: 24 (DW_TAG_subprogram)
    <6f5>   DW_AT_external    : 1
    <6f5>   DW_AT_name        : (indirect string, offset: 0x1bdf5): bmp_i2c_setup
    <6f9>   DW_AT_decl_file   : 1
    <6fa>   DW_AT_decl_line   : 122
    <6fb>   DW_AT_decl_column : 6
    <6fc>   DW_AT_prototyped  : 1
    <6fc>   DW_AT_low_pc      : 0x80017c0
    <700>   DW_AT_high_pc     : 0x18
    <704>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <706>   DW_AT_call_all_tail_calls: 1
 <1><706>: Abbrev Number: 12 (DW_TAG_subprogram)
    <707>   DW_AT_external    : 1
    <707>   DW_AT_name        : (indirect string, offset: 0x7ff5b): pressure
    <70b>   DW_AT_decl_file   : 1
    <70b>   DW_AT_decl_line   : 68
    <70c>   DW_AT_decl_column : 8
    <70d>   DW_AT_prototyped  : 1
    <70d>   DW_AT_type        : <0x601>
    <711>   DW_AT_low_pc      : 0x8001318
    <715>   DW_AT_high_pc     : 0x4a8
    <719>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <71b>   DW_AT_call_all_tail_calls: 1
    <71b>   DW_AT_sibling     : <0x811>
 <2><71f>: Abbrev Number: 2 (DW_TAG_variable)
    <720>   DW_AT_name        : (indirect string, offset: 0x5c7c0): var1
    <724>   DW_AT_decl_file   : 1
    <724>   DW_AT_decl_line   : 69
    <725>   DW_AT_decl_column : 9
    <726>   DW_AT_type        : <0x601>
    <72a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><72d>: Abbrev Number: 2 (DW_TAG_variable)
    <72e>   DW_AT_name        : (indirect string, offset: 0x5c7c5): var2
    <732>   DW_AT_decl_file   : 1
    <732>   DW_AT_decl_line   : 70
    <733>   DW_AT_decl_column : 9
    <734>   DW_AT_type        : <0x601>
    <738>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><73b>: Abbrev Number: 2 (DW_TAG_variable)
    <73c>   DW_AT_name        : (indirect string, offset: 0x50588): dig_P1
    <740>   DW_AT_decl_file   : 1
    <740>   DW_AT_decl_line   : 71
    <741>   DW_AT_decl_column : 17
    <742>   DW_AT_type        : <0x57>
    <746>   DW_AT_location    : 2 byte block: 91 5e 	(DW_OP_fbreg: -34)
 <2><749>: Abbrev Number: 2 (DW_TAG_variable)
    <74a>   DW_AT_name        : (indirect string, offset: 0x2a4df): dig_P2
    <74e>   DW_AT_decl_file   : 1
    <74e>   DW_AT_decl_line   : 72
    <74f>   DW_AT_decl_column : 15
    <750>   DW_AT_type        : <0x44>
    <754>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><757>: Abbrev Number: 2 (DW_TAG_variable)
    <758>   DW_AT_name        : (indirect string, offset: 0x505be): dig_P3
    <75c>   DW_AT_decl_file   : 1
    <75c>   DW_AT_decl_line   : 73
    <75d>   DW_AT_decl_column : 15
    <75e>   DW_AT_type        : <0x44>
    <762>   DW_AT_location    : 2 byte block: 91 5a 	(DW_OP_fbreg: -38)
 <2><765>: Abbrev Number: 2 (DW_TAG_variable)
    <766>   DW_AT_name        : (indirect string, offset: 0x505c5): dig_P4
    <76a>   DW_AT_decl_file   : 1
    <76a>   DW_AT_decl_line   : 74
    <76b>   DW_AT_decl_column : 15
    <76c>   DW_AT_type        : <0x44>
    <770>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><773>: Abbrev Number: 2 (DW_TAG_variable)
    <774>   DW_AT_name        : (indirect string, offset: 0x505cc): dig_P5
    <778>   DW_AT_decl_file   : 1
    <778>   DW_AT_decl_line   : 75
    <779>   DW_AT_decl_column : 15
    <77a>   DW_AT_type        : <0x44>
    <77e>   DW_AT_location    : 2 byte block: 91 56 	(DW_OP_fbreg: -42)
 <2><781>: Abbrev Number: 2 (DW_TAG_variable)
    <782>   DW_AT_name        : (indirect string, offset: 0x505d3): dig_P6
    <786>   DW_AT_decl_file   : 1
    <786>   DW_AT_decl_line   : 76
    <787>   DW_AT_decl_column : 15
    <788>   DW_AT_type        : <0x44>
    <78c>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><78f>: Abbrev Number: 2 (DW_TAG_variable)
    <790>   DW_AT_name        : (indirect string, offset: 0x2a631): dig_P7
    <794>   DW_AT_decl_file   : 1
    <794>   DW_AT_decl_line   : 77
    <795>   DW_AT_decl_column : 15
    <796>   DW_AT_type        : <0x44>
    <79a>   DW_AT_location    : 2 byte block: 91 52 	(DW_OP_fbreg: -46)
 <2><79d>: Abbrev Number: 2 (DW_TAG_variable)
    <79e>   DW_AT_name        : (indirect string, offset: 0xa515d): dig_P8
    <7a2>   DW_AT_decl_file   : 1
    <7a2>   DW_AT_decl_line   : 78
    <7a3>   DW_AT_decl_column : 15
    <7a4>   DW_AT_type        : <0x44>
    <7a8>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><7ab>: Abbrev Number: 2 (DW_TAG_variable)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x50623): dig_P9
    <7b0>   DW_AT_decl_file   : 1
    <7b0>   DW_AT_decl_line   : 79
    <7b1>   DW_AT_decl_column : 15
    <7b2>   DW_AT_type        : <0x44>
    <7b6>   DW_AT_location    : 2 byte block: 91 4e 	(DW_OP_fbreg: -50)
 <2><7b9>: Abbrev Number: 2 (DW_TAG_variable)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x5f8e4): t_fine
    <7be>   DW_AT_decl_file   : 1
    <7be>   DW_AT_decl_line   : 80
    <7bf>   DW_AT_decl_column : 11
    <7c0>   DW_AT_type        : <0xb1>
    <7c4>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><7c7>: Abbrev Number: 2 (DW_TAG_variable)
    <7c8>   DW_AT_name        : (indirect string, offset: 0x7ff57): raw_pressure
    <7cc>   DW_AT_decl_file   : 1
    <7cc>   DW_AT_decl_line   : 81
    <7cd>   DW_AT_decl_column : 14
    <7ce>   DW_AT_type        : <0x5e>
    <7d2>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><7d5>: Abbrev Number: 25 (DW_TAG_variable)
    <7d6>   DW_AT_name        : p
    <7d8>   DW_AT_decl_file   : 1
    <7d9>   DW_AT_decl_line   : 82
    <7da>   DW_AT_decl_column : 9
    <7db>   DW_AT_type        : <0x601>
    <7df>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><7e3>: Abbrev Number: 2 (DW_TAG_variable)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xb10bd): press_msb
    <7e8>   DW_AT_decl_file   : 1
    <7e8>   DW_AT_decl_line   : 96
    <7e9>   DW_AT_decl_column : 10
    <7ea>   DW_AT_type        : <0x94>
    <7ee>   DW_AT_location    : 3 byte block: 91 b7 7f 	(DW_OP_fbreg: -73)
 <2><7f2>: Abbrev Number: 2 (DW_TAG_variable)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x94b25): press_lsb
    <7f7>   DW_AT_decl_file   : 1
    <7f7>   DW_AT_decl_line   : 97
    <7f8>   DW_AT_decl_column : 10
    <7f9>   DW_AT_type        : <0x94>
    <7fd>   DW_AT_location    : 3 byte block: 91 b6 7f 	(DW_OP_fbreg: -74)
 <2><801>: Abbrev Number: 2 (DW_TAG_variable)
    <802>   DW_AT_name        : (indirect string, offset: 0x79848): press_xlsb
    <806>   DW_AT_decl_file   : 1
    <806>   DW_AT_decl_line   : 98
    <807>   DW_AT_decl_column : 10
    <808>   DW_AT_type        : <0x94>
    <80c>   DW_AT_location    : 3 byte block: 91 b5 7f 	(DW_OP_fbreg: -75)
 <2><810>: Abbrev Number: 0
 <1><811>: Abbrev Number: 12 (DW_TAG_subprogram)
    <812>   DW_AT_external    : 1
    <812>   DW_AT_name        : (indirect string, offset: 0x35d53): temperature
    <816>   DW_AT_decl_file   : 1
    <816>   DW_AT_decl_line   : 25
    <817>   DW_AT_decl_column : 8
    <818>   DW_AT_prototyped  : 1
    <818>   DW_AT_type        : <0x601>
    <81c>   DW_AT_low_pc      : 0x80010a0
    <820>   DW_AT_high_pc     : 0x274
    <824>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <826>   DW_AT_call_all_tail_calls: 1
    <826>   DW_AT_sibling     : <0x931>
 <2><82a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <82b>   DW_AT_name        : x
    <82d>   DW_AT_decl_file   : 1
    <82e>   DW_AT_decl_line   : 25
    <82f>   DW_AT_decl_column : 24
    <830>   DW_AT_type        : <0x86>
    <834>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <2><838>: Abbrev Number: 2 (DW_TAG_variable)
    <839>   DW_AT_name        : (indirect string, offset: 0x7349d): calib_T1
    <83d>   DW_AT_decl_file   : 1
    <83d>   DW_AT_decl_line   : 26
    <83e>   DW_AT_decl_column : 17
    <83f>   DW_AT_type        : <0x57>
    <843>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><846>: Abbrev Number: 2 (DW_TAG_variable)
    <847>   DW_AT_name        : (indirect string, offset: 0x5d2fc): calib_T2
    <84b>   DW_AT_decl_file   : 1
    <84b>   DW_AT_decl_line   : 27
    <84c>   DW_AT_decl_column : 15
    <84d>   DW_AT_type        : <0x44>
    <851>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><854>: Abbrev Number: 2 (DW_TAG_variable)
    <855>   DW_AT_name        : (indirect string, offset: 0x734d9): calib_T3
    <859>   DW_AT_decl_file   : 1
    <859>   DW_AT_decl_line   : 28
    <85a>   DW_AT_decl_column : 15
    <85b>   DW_AT_type        : <0x44>
    <85f>   DW_AT_location    : 2 byte block: 91 62 	(DW_OP_fbreg: -30)
 <2><862>: Abbrev Number: 2 (DW_TAG_variable)
    <863>   DW_AT_name        : (indirect string, offset: 0x35d4f): raw_temperature
    <867>   DW_AT_decl_file   : 1
    <867>   DW_AT_decl_line   : 29
    <868>   DW_AT_decl_column : 14
    <869>   DW_AT_type        : <0x5e>
    <86d>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><870>: Abbrev Number: 2 (DW_TAG_variable)
    <871>   DW_AT_name        : (indirect string, offset: 0x5c7c0): var1
    <875>   DW_AT_decl_file   : 1
    <875>   DW_AT_decl_line   : 30
    <876>   DW_AT_decl_column : 9
    <877>   DW_AT_type        : <0x601>
    <87b>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><87e>: Abbrev Number: 2 (DW_TAG_variable)
    <87f>   DW_AT_name        : (indirect string, offset: 0x5c7c5): var2
    <883>   DW_AT_decl_file   : 1
    <883>   DW_AT_decl_line   : 31
    <884>   DW_AT_decl_column : 9
    <885>   DW_AT_type        : <0x601>
    <889>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><88c>: Abbrev Number: 2 (DW_TAG_variable)
    <88d>   DW_AT_name        : (indirect string, offset: 0x5f8e4): t_fine
    <891>   DW_AT_decl_file   : 1
    <891>   DW_AT_decl_line   : 32
    <892>   DW_AT_decl_column : 11
    <893>   DW_AT_type        : <0xb1>
    <897>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><89a>: Abbrev Number: 2 (DW_TAG_variable)
    <89b>   DW_AT_name        : (indirect string, offset: 0x4fb86): final_temp
    <89f>   DW_AT_decl_file   : 1
    <89f>   DW_AT_decl_line   : 33
    <8a0>   DW_AT_decl_column : 9
    <8a1>   DW_AT_type        : <0x601>
    <8a5>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><8a9>: Abbrev Number: 2 (DW_TAG_variable)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xb4b5e): t1_lsb
    <8ae>   DW_AT_decl_file   : 1
    <8ae>   DW_AT_decl_line   : 35
    <8af>   DW_AT_decl_column : 10
    <8b0>   DW_AT_type        : <0x94>
    <8b4>   DW_AT_location    : 3 byte block: 91 b7 7f 	(DW_OP_fbreg: -73)
 <2><8b8>: Abbrev Number: 2 (DW_TAG_variable)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x2f5b): t1_msb
    <8bd>   DW_AT_decl_file   : 1
    <8bd>   DW_AT_decl_line   : 36
    <8be>   DW_AT_decl_column : 10
    <8bf>   DW_AT_type        : <0x94>
    <8c3>   DW_AT_location    : 3 byte block: 91 b6 7f 	(DW_OP_fbreg: -74)
 <2><8c7>: Abbrev Number: 2 (DW_TAG_variable)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x281c7): t2_lsb
    <8cc>   DW_AT_decl_file   : 1
    <8cc>   DW_AT_decl_line   : 39
    <8cd>   DW_AT_decl_column : 10
    <8ce>   DW_AT_type        : <0x94>
    <8d2>   DW_AT_location    : 3 byte block: 91 b5 7f 	(DW_OP_fbreg: -75)
 <2><8d6>: Abbrev Number: 2 (DW_TAG_variable)
    <8d7>   DW_AT_name        : (indirect string, offset: 0xad1d7): t2_msb
    <8db>   DW_AT_decl_file   : 1
    <8db>   DW_AT_decl_line   : 40
    <8dc>   DW_AT_decl_column : 10
    <8dd>   DW_AT_type        : <0x94>
    <8e1>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><8e5>: Abbrev Number: 2 (DW_TAG_variable)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x6920c): t3_lsb
    <8ea>   DW_AT_decl_file   : 1
    <8ea>   DW_AT_decl_line   : 43
    <8eb>   DW_AT_decl_column : 10
    <8ec>   DW_AT_type        : <0x94>
    <8f0>   DW_AT_location    : 3 byte block: 91 b3 7f 	(DW_OP_fbreg: -77)
 <2><8f4>: Abbrev Number: 2 (DW_TAG_variable)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x86019): t3_msb
    <8f9>   DW_AT_decl_file   : 1
    <8f9>   DW_AT_decl_line   : 44
    <8fa>   DW_AT_decl_column : 10
    <8fb>   DW_AT_type        : <0x94>
    <8ff>   DW_AT_location    : 3 byte block: 91 b2 7f 	(DW_OP_fbreg: -78)
 <2><903>: Abbrev Number: 2 (DW_TAG_variable)
    <904>   DW_AT_name        : (indirect string, offset: 0x4492): temp_msb
    <908>   DW_AT_decl_file   : 1
    <908>   DW_AT_decl_line   : 47
    <909>   DW_AT_decl_column : 10
    <90a>   DW_AT_type        : <0x94>
    <90e>   DW_AT_location    : 3 byte block: 91 b1 7f 	(DW_OP_fbreg: -79)
 <2><912>: Abbrev Number: 2 (DW_TAG_variable)
    <913>   DW_AT_name        : (indirect string, offset: 0xb657c): temp_lsb
    <917>   DW_AT_decl_file   : 1
    <917>   DW_AT_decl_line   : 48
    <918>   DW_AT_decl_column : 10
    <919>   DW_AT_type        : <0x94>
    <91d>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><921>: Abbrev Number: 2 (DW_TAG_variable)
    <922>   DW_AT_name        : (indirect string, offset: 0x4237d): temp_xlsb
    <926>   DW_AT_decl_file   : 1
    <926>   DW_AT_decl_line   : 49
    <927>   DW_AT_decl_column : 10
    <928>   DW_AT_type        : <0x94>
    <92c>   DW_AT_location    : 3 byte block: 91 af 7f 	(DW_OP_fbreg: -81)
 <2><930>: Abbrev Number: 0
 <1><931>: Abbrev Number: 12 (DW_TAG_subprogram)
    <932>   DW_AT_external    : 1
    <932>   DW_AT_name        : (indirect string, offset: 0x8f82b): bmp_hal_i2c_read
    <936>   DW_AT_decl_file   : 1
    <936>   DW_AT_decl_line   : 18
    <937>   DW_AT_decl_column : 9
    <938>   DW_AT_prototyped  : 1
    <938>   DW_AT_type        : <0x94>
    <93c>   DW_AT_low_pc      : 0x8001064
    <940>   DW_AT_high_pc     : 0x3c
    <944>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <946>   DW_AT_call_all_tail_calls: 1
    <946>   DW_AT_sibling     : <0x967>
 <2><94a>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <94b>   DW_AT_name        : (indirect string, offset: 0xfd69): reg_addr
    <94f>   DW_AT_decl_file   : 1
    <94f>   DW_AT_decl_line   : 18
    <950>   DW_AT_decl_column : 34
    <951>   DW_AT_type        : <0x94>
    <955>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><958>: Abbrev Number: 2 (DW_TAG_variable)
    <959>   DW_AT_name        : (indirect string, offset: 0x8273d): read_value
    <95d>   DW_AT_decl_file   : 1
    <95d>   DW_AT_decl_line   : 19
    <95e>   DW_AT_decl_column : 10
    <95f>   DW_AT_type        : <0x94>
    <963>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><966>: Abbrev Number: 0
 <1><967>: Abbrev Number: 27 (DW_TAG_subprogram)
    <968>   DW_AT_external    : 1
    <968>   DW_AT_name        : (indirect string, offset: 0xf6b2): bmp_hal_i2c_write
    <96c>   DW_AT_decl_file   : 1
    <96d>   DW_AT_decl_line   : 12
    <96e>   DW_AT_decl_column : 6
    <96f>   DW_AT_prototyped  : 1
    <96f>   DW_AT_low_pc      : 0x8001024
    <973>   DW_AT_high_pc     : 0x40
    <977>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <979>   DW_AT_call_all_tail_calls: 1
 <2><979>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <97a>   DW_AT_name        : (indirect string, offset: 0xfd69): reg_addr
    <97e>   DW_AT_decl_file   : 1
    <97e>   DW_AT_decl_line   : 12
    <97f>   DW_AT_decl_column : 32
    <980>   DW_AT_type        : <0x94>
    <984>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><987>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <988>   DW_AT_name        : (indirect string, offset: 0x82742): value
    <98c>   DW_AT_decl_file   : 1
    <98c>   DW_AT_decl_line   : 12
    <98d>   DW_AT_decl_column : 50
    <98e>   DW_AT_type        : <0x94>
    <992>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><995>: Abbrev Number: 2 (DW_TAG_variable)
    <996>   DW_AT_name        : (indirect string, offset: 0x74a54): data_to_write
    <99a>   DW_AT_decl_file   : 1
    <99a>   DW_AT_decl_line   : 13
    <99b>   DW_AT_decl_column : 10
    <99c>   DW_AT_type        : <0x94>
    <9a0>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 0
  Compilation Unit @ offset 0x9a5:
   Length:        0x32f6 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1bc
   Pointer Size:  4
 <0><9b1>: Abbrev Number: 56 (DW_TAG_compile_unit)
    <9b2>   DW_AT_producer    : (indirect string, offset: 0x35918): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <9b6>   DW_AT_language    : 29	(C11)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x116679): ../Core/Src/main.c
    <9bb>   DW_AT_comp_dir    : (indirect string, offset: 0xb438f): C:/Embedded stuff/Marut_workspace_stm32/MARUT_FCU_Nucleo/Debug
    <9bf>   DW_AT_ranges      : 0x40
    <9c3>   DW_AT_low_pc      : 0
    <9c7>   DW_AT_stmt_list   : 0xb32
    <9cb>   DW_AT_macros      : 0x2072d
 <1><9cf>: Abbrev Number: 19 (DW_TAG_base_type)
    <9d0>   DW_AT_byte_size   : 1
    <9d1>   DW_AT_encoding    : 6	(signed char)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x662d3): signed char
 <1><9d6>: Abbrev Number: 5 (DW_TAG_typedef)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x3b5d4): __uint8_t
    <9db>   DW_AT_decl_file   : 10
    <9dc>   DW_AT_decl_line   : 43
    <9dd>   DW_AT_decl_column : 24
    <9de>   DW_AT_type        : <0x9e2>
 <1><9e2>: Abbrev Number: 19 (DW_TAG_base_type)
    <9e3>   DW_AT_byte_size   : 1
    <9e4>   DW_AT_encoding    : 8	(unsigned char)
    <9e5>   DW_AT_name        : (indirect string, offset: 0xc6de5): unsigned char
 <1><9e9>: Abbrev Number: 24 (DW_TAG_const_type)
    <9ea>   DW_AT_type        : <0x9e2>
 <1><9ee>: Abbrev Number: 5 (DW_TAG_typedef)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x10caec): __int16_t
    <9f3>   DW_AT_decl_file   : 10
    <9f4>   DW_AT_decl_line   : 55
    <9f5>   DW_AT_decl_column : 24
    <9f6>   DW_AT_type        : <0x9fa>
 <1><9fa>: Abbrev Number: 19 (DW_TAG_base_type)
    <9fb>   DW_AT_byte_size   : 2
    <9fc>   DW_AT_encoding    : 5	(signed)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x998ed): short int
 <1><a01>: Abbrev Number: 5 (DW_TAG_typedef)
    <a02>   DW_AT_name        : (indirect string, offset: 0xa80fd): __uint16_t
    <a06>   DW_AT_decl_file   : 10
    <a07>   DW_AT_decl_line   : 57
    <a08>   DW_AT_decl_column : 25
    <a09>   DW_AT_type        : <0xa0d>
 <1><a0d>: Abbrev Number: 19 (DW_TAG_base_type)
    <a0e>   DW_AT_byte_size   : 2
    <a0f>   DW_AT_encoding    : 7	(unsigned)
    <a10>   DW_AT_name        : (indirect string, offset: 0xc573d): short unsigned int
 <1><a14>: Abbrev Number: 5 (DW_TAG_typedef)
    <a15>   DW_AT_name        : (indirect string, offset: 0xfe01a): __int32_t
    <a19>   DW_AT_decl_file   : 10
    <a1a>   DW_AT_decl_line   : 77
    <a1b>   DW_AT_decl_column : 24
    <a1c>   DW_AT_type        : <0xa20>
 <1><a20>: Abbrev Number: 19 (DW_TAG_base_type)
    <a21>   DW_AT_byte_size   : 4
    <a22>   DW_AT_encoding    : 5	(signed)
    <a23>   DW_AT_name        : (indirect string, offset: 0x11aa5): long int
 <1><a27>: Abbrev Number: 5 (DW_TAG_typedef)
    <a28>   DW_AT_name        : (indirect string, offset: 0x82ad3): __uint32_t
    <a2c>   DW_AT_decl_file   : 10
    <a2d>   DW_AT_decl_line   : 79
    <a2e>   DW_AT_decl_column : 25
    <a2f>   DW_AT_type        : <0xa33>
 <1><a33>: Abbrev Number: 19 (DW_TAG_base_type)
    <a34>   DW_AT_byte_size   : 4
    <a35>   DW_AT_encoding    : 7	(unsigned)
    <a36>   DW_AT_name        : (indirect string, offset: 0x4db34): long unsigned int
 <1><a3a>: Abbrev Number: 19 (DW_TAG_base_type)
    <a3b>   DW_AT_byte_size   : 8
    <a3c>   DW_AT_encoding    : 5	(signed)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x5cb1e): long long int
 <1><a41>: Abbrev Number: 5 (DW_TAG_typedef)
    <a42>   DW_AT_name        : (indirect string, offset: 0xef45b): __uint64_t
    <a46>   DW_AT_decl_file   : 10
    <a47>   DW_AT_decl_line   : 105
    <a48>   DW_AT_decl_column : 25
    <a49>   DW_AT_type        : <0xa4d>
 <1><a4d>: Abbrev Number: 19 (DW_TAG_base_type)
    <a4e>   DW_AT_byte_size   : 8
    <a4f>   DW_AT_encoding    : 7	(unsigned)
    <a50>   DW_AT_name        : (indirect string, offset: 0x2aa11): long long unsigned int
 <1><a54>: Abbrev Number: 57 (DW_TAG_base_type)
    <a55>   DW_AT_byte_size   : 4
    <a56>   DW_AT_encoding    : 5	(signed)
    <a57>   DW_AT_name        : int
 <1><a5b>: Abbrev Number: 19 (DW_TAG_base_type)
    <a5c>   DW_AT_byte_size   : 4
    <a5d>   DW_AT_encoding    : 7	(unsigned)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x10fdf): unsigned int
 <1><a62>: Abbrev Number: 5 (DW_TAG_typedef)
    <a63>   DW_AT_name        : (indirect string, offset: 0x3b5d6): uint8_t
    <a67>   DW_AT_decl_file   : 11
    <a68>   DW_AT_decl_line   : 24
    <a69>   DW_AT_decl_column : 19
    <a6a>   DW_AT_type        : <0x9d6>
 <1><a6e>: Abbrev Number: 24 (DW_TAG_const_type)
    <a6f>   DW_AT_type        : <0xa62>
 <1><a73>: Abbrev Number: 5 (DW_TAG_typedef)
    <a74>   DW_AT_name        : (indirect string, offset: 0x10caee): int16_t
    <a78>   DW_AT_decl_file   : 11
    <a79>   DW_AT_decl_line   : 32
    <a7a>   DW_AT_decl_column : 19
    <a7b>   DW_AT_type        : <0x9ee>
 <1><a7f>: Abbrev Number: 5 (DW_TAG_typedef)
    <a80>   DW_AT_name        : (indirect string, offset: 0x107eff): uint16_t
    <a84>   DW_AT_decl_file   : 11
    <a85>   DW_AT_decl_line   : 36
    <a86>   DW_AT_decl_column : 20
    <a87>   DW_AT_type        : <0xa01>
 <1><a8b>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <a8c>   DW_AT_type        : <0xa7f>
 <1><a90>: Abbrev Number: 5 (DW_TAG_typedef)
    <a91>   DW_AT_name        : (indirect string, offset: 0xfe01c): int32_t
    <a95>   DW_AT_decl_file   : 11
    <a96>   DW_AT_decl_line   : 44
    <a97>   DW_AT_decl_column : 19
    <a98>   DW_AT_type        : <0xa14>
 <1><a9c>: Abbrev Number: 5 (DW_TAG_typedef)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x11d9c5): uint32_t
    <aa1>   DW_AT_decl_file   : 11
    <aa2>   DW_AT_decl_line   : 48
    <aa3>   DW_AT_decl_column : 20
    <aa4>   DW_AT_type        : <0xa27>
 <1><aa8>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <aa9>   DW_AT_type        : <0xa9c>
 <1><aad>: Abbrev Number: 24 (DW_TAG_const_type)
    <aae>   DW_AT_type        : <0xa9c>
 <1><ab2>: Abbrev Number: 5 (DW_TAG_typedef)
    <ab3>   DW_AT_name        : (indirect string, offset: 0xef45d): uint64_t
    <ab7>   DW_AT_decl_file   : 11
    <ab8>   DW_AT_decl_line   : 60
    <ab9>   DW_AT_decl_column : 20
    <aba>   DW_AT_type        : <0xa41>
 <1><abe>: Abbrev Number: 13 (DW_TAG_array_type)
    <abf>   DW_AT_type        : <0xa9c>
    <ac3>   DW_AT_sibling     : <0xace>
 <2><ac7>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ac8>   DW_AT_type        : <0xa5b>
    <acc>   DW_AT_upper_bound : 1
 <2><acd>: Abbrev Number: 0
 <1><ace>: Abbrev Number: 13 (DW_TAG_array_type)
    <acf>   DW_AT_type        : <0xa9c>
    <ad3>   DW_AT_sibling     : <0xade>
 <2><ad7>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ad8>   DW_AT_type        : <0xa5b>
    <adc>   DW_AT_upper_bound : 7
 <2><add>: Abbrev Number: 0
 <1><ade>: Abbrev Number: 25 (DW_TAG_structure_type)
    <adf>   DW_AT_byte_size   : 24
    <ae0>   DW_AT_decl_file   : 12
    <ae1>   DW_AT_decl_line   : 362
    <ae3>   DW_AT_decl_column : 9
    <ae3>   DW_AT_sibling     : <0xb35>
 <2><ae7>: Abbrev Number: 8 (DW_TAG_member)
    <ae8>   DW_AT_name        : CR
    <aeb>   DW_AT_decl_file   : 12
    <aeb>   DW_AT_decl_line   : 364
    <aed>   DW_AT_decl_column : 17
    <aed>   DW_AT_type        : <0xaa8>
    <af1>   DW_AT_data_member_location: 0
 <2><af2>: Abbrev Number: 3 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0x189b4): NDTR
    <af7>   DW_AT_decl_file   : 12
    <af8>   DW_AT_decl_line   : 365
    <afa>   DW_AT_decl_column : 17
    <afb>   DW_AT_type        : <0xaa8>
    <aff>   DW_AT_data_member_location: 4
 <2><b00>: Abbrev Number: 8 (DW_TAG_member)
    <b01>   DW_AT_name        : PAR
    <b05>   DW_AT_decl_file   : 12
    <b05>   DW_AT_decl_line   : 366
    <b07>   DW_AT_decl_column : 17
    <b07>   DW_AT_type        : <0xaa8>
    <b0b>   DW_AT_data_member_location: 8
 <2><b0c>: Abbrev Number: 3 (DW_TAG_member)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x54417): M0AR
    <b11>   DW_AT_decl_file   : 12
    <b12>   DW_AT_decl_line   : 367
    <b14>   DW_AT_decl_column : 17
    <b15>   DW_AT_type        : <0xaa8>
    <b19>   DW_AT_data_member_location: 12
 <2><b1a>: Abbrev Number: 3 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x70fa6): M1AR
    <b1f>   DW_AT_decl_file   : 12
    <b20>   DW_AT_decl_line   : 368
    <b22>   DW_AT_decl_column : 17
    <b23>   DW_AT_type        : <0xaa8>
    <b27>   DW_AT_data_member_location: 16
 <2><b28>: Abbrev Number: 8 (DW_TAG_member)
    <b29>   DW_AT_name        : FCR
    <b2d>   DW_AT_decl_file   : 12
    <b2d>   DW_AT_decl_line   : 369
    <b2f>   DW_AT_decl_column : 17
    <b2f>   DW_AT_type        : <0xaa8>
    <b33>   DW_AT_data_member_location: 20
 <2><b34>: Abbrev Number: 0
 <1><b35>: Abbrev Number: 18 (DW_TAG_typedef)
    <b36>   DW_AT_name        : (indirect string, offset: 0x1985f): DMA_Stream_TypeDef
    <b3a>   DW_AT_decl_file   : 12
    <b3b>   DW_AT_decl_line   : 370
    <b3d>   DW_AT_decl_column : 3
    <b3e>   DW_AT_type        : <0xade>
 <1><b42>: Abbrev Number: 13 (DW_TAG_array_type)
    <b43>   DW_AT_type        : <0xaa8>
    <b47>   DW_AT_sibling     : <0xb52>
 <2><b4b>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <b4c>   DW_AT_type        : <0xa5b>
    <b50>   DW_AT_upper_bound : 1
 <2><b51>: Abbrev Number: 0
 <1><b52>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <b53>   DW_AT_type        : <0xb42>
 <1><b57>: Abbrev Number: 25 (DW_TAG_structure_type)
    <b58>   DW_AT_byte_size   : 40
    <b59>   DW_AT_decl_file   : 12
    <b5a>   DW_AT_decl_line   : 458
    <b5c>   DW_AT_decl_column : 9
    <b5c>   DW_AT_sibling     : <0xbd9>
 <2><b60>: Abbrev Number: 3 (DW_TAG_member)
    <b61>   DW_AT_name        : (indirect string, offset: 0xcef24): MODER
    <b65>   DW_AT_decl_file   : 12
    <b66>   DW_AT_decl_line   : 460
    <b68>   DW_AT_decl_column : 17
    <b69>   DW_AT_type        : <0xaa8>
    <b6d>   DW_AT_data_member_location: 0
 <2><b6e>: Abbrev Number: 3 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x11bd9a): OTYPER
    <b73>   DW_AT_decl_file   : 12
    <b74>   DW_AT_decl_line   : 461
    <b76>   DW_AT_decl_column : 17
    <b77>   DW_AT_type        : <0xaa8>
    <b7b>   DW_AT_data_member_location: 4
 <2><b7c>: Abbrev Number: 3 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x114cbc): OSPEEDR
    <b81>   DW_AT_decl_file   : 12
    <b82>   DW_AT_decl_line   : 462
    <b84>   DW_AT_decl_column : 17
    <b85>   DW_AT_type        : <0xaa8>
    <b89>   DW_AT_data_member_location: 8
 <2><b8a>: Abbrev Number: 3 (DW_TAG_member)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x10727b): PUPDR
    <b8f>   DW_AT_decl_file   : 12
    <b90>   DW_AT_decl_line   : 463
    <b92>   DW_AT_decl_column : 17
    <b93>   DW_AT_type        : <0xaa8>
    <b97>   DW_AT_data_member_location: 12
 <2><b98>: Abbrev Number: 8 (DW_TAG_member)
    <b99>   DW_AT_name        : IDR
    <b9d>   DW_AT_decl_file   : 12
    <b9d>   DW_AT_decl_line   : 464
    <b9f>   DW_AT_decl_column : 17
    <b9f>   DW_AT_type        : <0xaa8>
    <ba3>   DW_AT_data_member_location: 16
 <2><ba4>: Abbrev Number: 8 (DW_TAG_member)
    <ba5>   DW_AT_name        : ODR
    <ba9>   DW_AT_decl_file   : 12
    <ba9>   DW_AT_decl_line   : 465
    <bab>   DW_AT_decl_column : 17
    <bab>   DW_AT_type        : <0xaa8>
    <baf>   DW_AT_data_member_location: 20
 <2><bb0>: Abbrev Number: 3 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0xddbf1): BSRR
    <bb5>   DW_AT_decl_file   : 12
    <bb6>   DW_AT_decl_line   : 466
    <bb8>   DW_AT_decl_column : 17
    <bb9>   DW_AT_type        : <0xaa8>
    <bbd>   DW_AT_data_member_location: 24
 <2><bbe>: Abbrev Number: 3 (DW_TAG_member)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x113901): LCKR
    <bc3>   DW_AT_decl_file   : 12
    <bc4>   DW_AT_decl_line   : 467
    <bc6>   DW_AT_decl_column : 17
    <bc7>   DW_AT_type        : <0xaa8>
    <bcb>   DW_AT_data_member_location: 28
 <2><bcc>: Abbrev Number: 8 (DW_TAG_member)
    <bcd>   DW_AT_name        : AFR
    <bd1>   DW_AT_decl_file   : 12
    <bd1>   DW_AT_decl_line   : 468
    <bd3>   DW_AT_decl_column : 17
    <bd3>   DW_AT_type        : <0xb52>
    <bd7>   DW_AT_data_member_location: 32
 <2><bd8>: Abbrev Number: 0
 <1><bd9>: Abbrev Number: 18 (DW_TAG_typedef)
    <bda>   DW_AT_name        : (indirect string, offset: 0x11e9f8): GPIO_TypeDef
    <bde>   DW_AT_decl_file   : 12
    <bdf>   DW_AT_decl_line   : 469
    <be1>   DW_AT_decl_column : 3
    <be2>   DW_AT_type        : <0xb57>
 <1><be6>: Abbrev Number: 25 (DW_TAG_structure_type)
    <be7>   DW_AT_byte_size   : 40
    <be8>   DW_AT_decl_file   : 12
    <be9>   DW_AT_decl_line   : 490
    <beb>   DW_AT_decl_column : 9
    <beb>   DW_AT_sibling     : <0xc6f>
 <2><bef>: Abbrev Number: 8 (DW_TAG_member)
    <bf0>   DW_AT_name        : CR1
    <bf4>   DW_AT_decl_file   : 12
    <bf4>   DW_AT_decl_line   : 492
    <bf6>   DW_AT_decl_column : 17
    <bf6>   DW_AT_type        : <0xaa8>
    <bfa>   DW_AT_data_member_location: 0
 <2><bfb>: Abbrev Number: 8 (DW_TAG_member)
    <bfc>   DW_AT_name        : CR2
    <c00>   DW_AT_decl_file   : 12
    <c00>   DW_AT_decl_line   : 493
    <c02>   DW_AT_decl_column : 17
    <c02>   DW_AT_type        : <0xaa8>
    <c06>   DW_AT_data_member_location: 4
 <2><c07>: Abbrev Number: 3 (DW_TAG_member)
    <c08>   DW_AT_name        : (indirect string, offset: 0x1ec66): OAR1
    <c0c>   DW_AT_decl_file   : 12
    <c0d>   DW_AT_decl_line   : 494
    <c0f>   DW_AT_decl_column : 17
    <c10>   DW_AT_type        : <0xaa8>
    <c14>   DW_AT_data_member_location: 8
 <2><c15>: Abbrev Number: 3 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0x3a363): OAR2
    <c1a>   DW_AT_decl_file   : 12
    <c1b>   DW_AT_decl_line   : 495
    <c1d>   DW_AT_decl_column : 17
    <c1e>   DW_AT_type        : <0xaa8>
    <c22>   DW_AT_data_member_location: 12
 <2><c23>: Abbrev Number: 8 (DW_TAG_member)
    <c24>   DW_AT_name        : DR
    <c27>   DW_AT_decl_file   : 12
    <c27>   DW_AT_decl_line   : 496
    <c29>   DW_AT_decl_column : 17
    <c29>   DW_AT_type        : <0xaa8>
    <c2d>   DW_AT_data_member_location: 16
 <2><c2e>: Abbrev Number: 8 (DW_TAG_member)
    <c2f>   DW_AT_name        : SR1
    <c33>   DW_AT_decl_file   : 12
    <c33>   DW_AT_decl_line   : 497
    <c35>   DW_AT_decl_column : 17
    <c35>   DW_AT_type        : <0xaa8>
    <c39>   DW_AT_data_member_location: 20
 <2><c3a>: Abbrev Number: 8 (DW_TAG_member)
    <c3b>   DW_AT_name        : SR2
    <c3f>   DW_AT_decl_file   : 12
    <c3f>   DW_AT_decl_line   : 498
    <c41>   DW_AT_decl_column : 17
    <c41>   DW_AT_type        : <0xaa8>
    <c45>   DW_AT_data_member_location: 24
 <2><c46>: Abbrev Number: 8 (DW_TAG_member)
    <c47>   DW_AT_name        : CCR
    <c4b>   DW_AT_decl_file   : 12
    <c4b>   DW_AT_decl_line   : 499
    <c4d>   DW_AT_decl_column : 17
    <c4d>   DW_AT_type        : <0xaa8>
    <c51>   DW_AT_data_member_location: 28
 <2><c52>: Abbrev Number: 3 (DW_TAG_member)
    <c53>   DW_AT_name        : (indirect string, offset: 0x689b1): TRISE
    <c57>   DW_AT_decl_file   : 12
    <c58>   DW_AT_decl_line   : 500
    <c5a>   DW_AT_decl_column : 17
    <c5b>   DW_AT_type        : <0xaa8>
    <c5f>   DW_AT_data_member_location: 32
 <2><c60>: Abbrev Number: 3 (DW_TAG_member)
    <c61>   DW_AT_name        : (indirect string, offset: 0x172a): FLTR
    <c65>   DW_AT_decl_file   : 12
    <c66>   DW_AT_decl_line   : 501
    <c68>   DW_AT_decl_column : 17
    <c69>   DW_AT_type        : <0xaa8>
    <c6d>   DW_AT_data_member_location: 36
 <2><c6e>: Abbrev Number: 0
 <1><c6f>: Abbrev Number: 18 (DW_TAG_typedef)
    <c70>   DW_AT_name        : (indirect string, offset: 0xa2303): I2C_TypeDef
    <c74>   DW_AT_decl_file   : 12
    <c75>   DW_AT_decl_line   : 502
    <c77>   DW_AT_decl_column : 3
    <c78>   DW_AT_type        : <0xbe6>
 <1><c7c>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c7d>   DW_AT_byte_size   : 8
    <c7e>   DW_AT_decl_file   : 12
    <c7f>   DW_AT_decl_line   : 540
    <c81>   DW_AT_decl_column : 9
    <c81>   DW_AT_sibling     : <0xc9d>
 <2><c85>: Abbrev Number: 8 (DW_TAG_member)
    <c86>   DW_AT_name        : CR
    <c89>   DW_AT_decl_file   : 12
    <c89>   DW_AT_decl_line   : 542
    <c8b>   DW_AT_decl_column : 17
    <c8b>   DW_AT_type        : <0xaa8>
    <c8f>   DW_AT_data_member_location: 0
 <2><c90>: Abbrev Number: 8 (DW_TAG_member)
    <c91>   DW_AT_name        : CSR
    <c95>   DW_AT_decl_file   : 12
    <c95>   DW_AT_decl_line   : 543
    <c97>   DW_AT_decl_column : 17
    <c97>   DW_AT_type        : <0xaa8>
    <c9b>   DW_AT_data_member_location: 4
 <2><c9c>: Abbrev Number: 0
 <1><c9d>: Abbrev Number: 18 (DW_TAG_typedef)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x107ce9): PWR_TypeDef
    <ca2>   DW_AT_decl_file   : 12
    <ca3>   DW_AT_decl_line   : 544
    <ca5>   DW_AT_decl_column : 3
    <ca6>   DW_AT_type        : <0xc7c>
 <1><caa>: Abbrev Number: 25 (DW_TAG_structure_type)
    <cab>   DW_AT_byte_size   : 152
    <cac>   DW_AT_decl_file   : 12
    <cad>   DW_AT_decl_line   : 550
    <caf>   DW_AT_decl_column : 9
    <caf>   DW_AT_sibling     : <0xe89>
 <2><cb3>: Abbrev Number: 8 (DW_TAG_member)
    <cb4>   DW_AT_name        : CR
    <cb7>   DW_AT_decl_file   : 12
    <cb7>   DW_AT_decl_line   : 552
    <cb9>   DW_AT_decl_column : 17
    <cb9>   DW_AT_type        : <0xaa8>
    <cbd>   DW_AT_data_member_location: 0
 <2><cbe>: Abbrev Number: 3 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x106611): PLLCFGR
    <cc3>   DW_AT_decl_file   : 12
    <cc4>   DW_AT_decl_line   : 553
    <cc6>   DW_AT_decl_column : 17
    <cc7>   DW_AT_type        : <0xaa8>
    <ccb>   DW_AT_data_member_location: 4
 <2><ccc>: Abbrev Number: 3 (DW_TAG_member)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x1182ad): CFGR
    <cd1>   DW_AT_decl_file   : 12
    <cd2>   DW_AT_decl_line   : 554
    <cd4>   DW_AT_decl_column : 17
    <cd5>   DW_AT_type        : <0xaa8>
    <cd9>   DW_AT_data_member_location: 8
 <2><cda>: Abbrev Number: 8 (DW_TAG_member)
    <cdb>   DW_AT_name        : CIR
    <cdf>   DW_AT_decl_file   : 12
    <cdf>   DW_AT_decl_line   : 555
    <ce1>   DW_AT_decl_column : 17
    <ce1>   DW_AT_type        : <0xaa8>
    <ce5>   DW_AT_data_member_location: 12
 <2><ce6>: Abbrev Number: 3 (DW_TAG_member)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x10d906): AHB1RSTR
    <ceb>   DW_AT_decl_file   : 12
    <cec>   DW_AT_decl_line   : 556
    <cee>   DW_AT_decl_column : 17
    <cef>   DW_AT_type        : <0xaa8>
    <cf3>   DW_AT_data_member_location: 16
 <2><cf4>: Abbrev Number: 3 (DW_TAG_member)
    <cf5>   DW_AT_name        : (indirect string, offset: 0xd820c): AHB2RSTR
    <cf9>   DW_AT_decl_file   : 12
    <cfa>   DW_AT_decl_line   : 557
    <cfc>   DW_AT_decl_column : 17
    <cfd>   DW_AT_type        : <0xaa8>
    <d01>   DW_AT_data_member_location: 20
 <2><d02>: Abbrev Number: 3 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0xed0f9): AHB3RSTR
    <d07>   DW_AT_decl_file   : 12
    <d08>   DW_AT_decl_line   : 558
    <d0a>   DW_AT_decl_column : 17
    <d0b>   DW_AT_type        : <0xaa8>
    <d0f>   DW_AT_data_member_location: 24
 <2><d10>: Abbrev Number: 3 (DW_TAG_member)
    <d11>   DW_AT_name        : (indirect string, offset: 0x11bd2f): RESERVED0
    <d15>   DW_AT_decl_file   : 12
    <d16>   DW_AT_decl_line   : 559
    <d18>   DW_AT_decl_column : 17
    <d19>   DW_AT_type        : <0xa9c>
    <d1d>   DW_AT_data_member_location: 28
 <2><d1e>: Abbrev Number: 3 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0xd815c): APB1RSTR
    <d23>   DW_AT_decl_file   : 12
    <d24>   DW_AT_decl_line   : 560
    <d26>   DW_AT_decl_column : 17
    <d27>   DW_AT_type        : <0xaa8>
    <d2b>   DW_AT_data_member_location: 32
 <2><d2c>: Abbrev Number: 3 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xecff8): APB2RSTR
    <d31>   DW_AT_decl_file   : 12
    <d32>   DW_AT_decl_line   : 561
    <d34>   DW_AT_decl_column : 17
    <d35>   DW_AT_type        : <0xaa8>
    <d39>   DW_AT_data_member_location: 36
 <2><d3a>: Abbrev Number: 3 (DW_TAG_member)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x11bd39): RESERVED1
    <d3f>   DW_AT_decl_file   : 12
    <d40>   DW_AT_decl_line   : 562
    <d42>   DW_AT_decl_column : 17
    <d43>   DW_AT_type        : <0xabe>
    <d47>   DW_AT_data_member_location: 40
 <2><d48>: Abbrev Number: 3 (DW_TAG_member)
    <d49>   DW_AT_name        : (indirect string, offset: 0xd4886): AHB1ENR
    <d4d>   DW_AT_decl_file   : 12
    <d4e>   DW_AT_decl_line   : 563
    <d50>   DW_AT_decl_column : 17
    <d51>   DW_AT_type        : <0xaa8>
    <d55>   DW_AT_data_member_location: 48
 <2><d56>: Abbrev Number: 3 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0xe02cb): AHB2ENR
    <d5b>   DW_AT_decl_file   : 12
    <d5c>   DW_AT_decl_line   : 564
    <d5e>   DW_AT_decl_column : 17
    <d5f>   DW_AT_type        : <0xaa8>
    <d63>   DW_AT_data_member_location: 52
 <2><d64>: Abbrev Number: 3 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0xeeca2): AHB3ENR
    <d69>   DW_AT_decl_file   : 12
    <d6a>   DW_AT_decl_line   : 565
    <d6c>   DW_AT_decl_column : 17
    <d6d>   DW_AT_type        : <0xaa8>
    <d71>   DW_AT_data_member_location: 56
 <2><d72>: Abbrev Number: 3 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0x11bd43): RESERVED2
    <d77>   DW_AT_decl_file   : 12
    <d78>   DW_AT_decl_line   : 566
    <d7a>   DW_AT_decl_column : 17
    <d7b>   DW_AT_type        : <0xa9c>
    <d7f>   DW_AT_data_member_location: 60
 <2><d80>: Abbrev Number: 3 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0xf8feb): APB1ENR
    <d85>   DW_AT_decl_file   : 12
    <d86>   DW_AT_decl_line   : 567
    <d88>   DW_AT_decl_column : 17
    <d89>   DW_AT_type        : <0xaa8>
    <d8d>   DW_AT_data_member_location: 64
 <2><d8e>: Abbrev Number: 3 (DW_TAG_member)
    <d8f>   DW_AT_name        : (indirect string, offset: 0xd86b3): APB2ENR
    <d93>   DW_AT_decl_file   : 12
    <d94>   DW_AT_decl_line   : 568
    <d96>   DW_AT_decl_column : 17
    <d97>   DW_AT_type        : <0xaa8>
    <d9b>   DW_AT_data_member_location: 68
 <2><d9c>: Abbrev Number: 3 (DW_TAG_member)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x11bd4d): RESERVED3
    <da1>   DW_AT_decl_file   : 12
    <da2>   DW_AT_decl_line   : 569
    <da4>   DW_AT_decl_column : 17
    <da5>   DW_AT_type        : <0xabe>
    <da9>   DW_AT_data_member_location: 72
 <2><daa>: Abbrev Number: 3 (DW_TAG_member)
    <dab>   DW_AT_name        : (indirect string, offset: 0x10ebdc): AHB1LPENR
    <daf>   DW_AT_decl_file   : 12
    <db0>   DW_AT_decl_line   : 570
    <db2>   DW_AT_decl_column : 17
    <db3>   DW_AT_type        : <0xaa8>
    <db7>   DW_AT_data_member_location: 80
 <2><db8>: Abbrev Number: 3 (DW_TAG_member)
    <db9>   DW_AT_name        : (indirect string, offset: 0xddaed): AHB2LPENR
    <dbd>   DW_AT_decl_file   : 12
    <dbe>   DW_AT_decl_line   : 571
    <dc0>   DW_AT_decl_column : 17
    <dc1>   DW_AT_type        : <0xaa8>
    <dc5>   DW_AT_data_member_location: 84
 <2><dc6>: Abbrev Number: 3 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x10523c): AHB3LPENR
    <dcb>   DW_AT_decl_file   : 12
    <dcc>   DW_AT_decl_line   : 572
    <dce>   DW_AT_decl_column : 17
    <dcf>   DW_AT_type        : <0xaa8>
    <dd3>   DW_AT_data_member_location: 88
 <2><dd4>: Abbrev Number: 3 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x11bd57): RESERVED4
    <dd9>   DW_AT_decl_file   : 12
    <dda>   DW_AT_decl_line   : 573
    <ddc>   DW_AT_decl_column : 17
    <ddd>   DW_AT_type        : <0xa9c>
    <de1>   DW_AT_data_member_location: 92
 <2><de2>: Abbrev Number: 3 (DW_TAG_member)
    <de3>   DW_AT_name        : (indirect string, offset: 0x111d0b): APB1LPENR
    <de7>   DW_AT_decl_file   : 12
    <de8>   DW_AT_decl_line   : 574
    <dea>   DW_AT_decl_column : 17
    <deb>   DW_AT_type        : <0xaa8>
    <def>   DW_AT_data_member_location: 96
 <2><df0>: Abbrev Number: 3 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0xd456f): APB2LPENR
    <df5>   DW_AT_decl_file   : 12
    <df6>   DW_AT_decl_line   : 575
    <df8>   DW_AT_decl_column : 17
    <df9>   DW_AT_type        : <0xaa8>
    <dfd>   DW_AT_data_member_location: 100
 <2><dfe>: Abbrev Number: 3 (DW_TAG_member)
    <dff>   DW_AT_name        : (indirect string, offset: 0xe31e3): RESERVED5
    <e03>   DW_AT_decl_file   : 12
    <e04>   DW_AT_decl_line   : 576
    <e06>   DW_AT_decl_column : 17
    <e07>   DW_AT_type        : <0xabe>
    <e0b>   DW_AT_data_member_location: 104
 <2><e0c>: Abbrev Number: 3 (DW_TAG_member)
    <e0d>   DW_AT_name        : (indirect string, offset: 0xe8ccf): BDCR
    <e11>   DW_AT_decl_file   : 12
    <e12>   DW_AT_decl_line   : 577
    <e14>   DW_AT_decl_column : 17
    <e15>   DW_AT_type        : <0xaa8>
    <e19>   DW_AT_data_member_location: 112
 <2><e1a>: Abbrev Number: 8 (DW_TAG_member)
    <e1b>   DW_AT_name        : CSR
    <e1f>   DW_AT_decl_file   : 12
    <e1f>   DW_AT_decl_line   : 578
    <e21>   DW_AT_decl_column : 17
    <e21>   DW_AT_type        : <0xaa8>
    <e25>   DW_AT_data_member_location: 116
 <2><e26>: Abbrev Number: 3 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0xfd5e1): RESERVED6
    <e2b>   DW_AT_decl_file   : 12
    <e2c>   DW_AT_decl_line   : 579
    <e2e>   DW_AT_decl_column : 17
    <e2f>   DW_AT_type        : <0xabe>
    <e33>   DW_AT_data_member_location: 120
 <2><e34>: Abbrev Number: 3 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0xf46a5): SSCGR
    <e39>   DW_AT_decl_file   : 12
    <e3a>   DW_AT_decl_line   : 580
    <e3c>   DW_AT_decl_column : 17
    <e3d>   DW_AT_type        : <0xaa8>
    <e41>   DW_AT_data_member_location: 128
 <2><e42>: Abbrev Number: 3 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0xe5107): PLLI2SCFGR
    <e47>   DW_AT_decl_file   : 12
    <e48>   DW_AT_decl_line   : 581
    <e4a>   DW_AT_decl_column : 17
    <e4b>   DW_AT_type        : <0xaa8>
    <e4f>   DW_AT_data_member_location: 132
 <2><e50>: Abbrev Number: 3 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x1182a7): PLLSAICFGR
    <e55>   DW_AT_decl_file   : 12
    <e56>   DW_AT_decl_line   : 582
    <e58>   DW_AT_decl_column : 17
    <e59>   DW_AT_type        : <0xaa8>
    <e5d>   DW_AT_data_member_location: 136
 <2><e5e>: Abbrev Number: 3 (DW_TAG_member)
    <e5f>   DW_AT_name        : (indirect string, offset: 0xed11c): DCKCFGR
    <e63>   DW_AT_decl_file   : 12
    <e64>   DW_AT_decl_line   : 583
    <e66>   DW_AT_decl_column : 17
    <e67>   DW_AT_type        : <0xaa8>
    <e6b>   DW_AT_data_member_location: 140
 <2><e6c>: Abbrev Number: 3 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x10b029): CKGATENR
    <e71>   DW_AT_decl_file   : 12
    <e72>   DW_AT_decl_line   : 584
    <e74>   DW_AT_decl_column : 17
    <e75>   DW_AT_type        : <0xaa8>
    <e79>   DW_AT_data_member_location: 144
 <2><e7a>: Abbrev Number: 3 (DW_TAG_member)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x106365): DCKCFGR2
    <e7f>   DW_AT_decl_file   : 12
    <e80>   DW_AT_decl_line   : 585
    <e82>   DW_AT_decl_column : 17
    <e83>   DW_AT_type        : <0xaa8>
    <e87>   DW_AT_data_member_location: 148
 <2><e88>: Abbrev Number: 0
 <1><e89>: Abbrev Number: 18 (DW_TAG_typedef)
    <e8a>   DW_AT_name        : (indirect string, offset: 0xef579): RCC_TypeDef
    <e8e>   DW_AT_decl_file   : 12
    <e8f>   DW_AT_decl_line   : 586
    <e91>   DW_AT_decl_column : 3
    <e92>   DW_AT_type        : <0xcaa>
 <1><e96>: Abbrev Number: 25 (DW_TAG_structure_type)
    <e97>   DW_AT_byte_size   : 84
    <e98>   DW_AT_decl_file   : 12
    <e99>   DW_AT_decl_line   : 745
    <e9b>   DW_AT_decl_column : 9
    <e9b>   DW_AT_sibling     : <0xfb0>
 <2><e9f>: Abbrev Number: 8 (DW_TAG_member)
    <ea0>   DW_AT_name        : CR1
    <ea4>   DW_AT_decl_file   : 12
    <ea4>   DW_AT_decl_line   : 747
    <ea6>   DW_AT_decl_column : 17
    <ea6>   DW_AT_type        : <0xaa8>
    <eaa>   DW_AT_data_member_location: 0
 <2><eab>: Abbrev Number: 8 (DW_TAG_member)
    <eac>   DW_AT_name        : CR2
    <eb0>   DW_AT_decl_file   : 12
    <eb0>   DW_AT_decl_line   : 748
    <eb2>   DW_AT_decl_column : 17
    <eb2>   DW_AT_type        : <0xaa8>
    <eb6>   DW_AT_data_member_location: 4
 <2><eb7>: Abbrev Number: 3 (DW_TAG_member)
    <eb8>   DW_AT_name        : (indirect string, offset: 0x3be39): SMCR
    <ebc>   DW_AT_decl_file   : 12
    <ebd>   DW_AT_decl_line   : 749
    <ebf>   DW_AT_decl_column : 17
    <ec0>   DW_AT_type        : <0xaa8>
    <ec4>   DW_AT_data_member_location: 8
 <2><ec5>: Abbrev Number: 3 (DW_TAG_member)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x41edf): DIER
    <eca>   DW_AT_decl_file   : 12
    <ecb>   DW_AT_decl_line   : 750
    <ecd>   DW_AT_decl_column : 17
    <ece>   DW_AT_type        : <0xaa8>
    <ed2>   DW_AT_data_member_location: 12
 <2><ed3>: Abbrev Number: 8 (DW_TAG_member)
    <ed4>   DW_AT_name        : SR
    <ed7>   DW_AT_decl_file   : 12
    <ed7>   DW_AT_decl_line   : 751
    <ed9>   DW_AT_decl_column : 17
    <ed9>   DW_AT_type        : <0xaa8>
    <edd>   DW_AT_data_member_location: 16
 <2><ede>: Abbrev Number: 8 (DW_TAG_member)
    <edf>   DW_AT_name        : EGR
    <ee3>   DW_AT_decl_file   : 12
    <ee3>   DW_AT_decl_line   : 752
    <ee5>   DW_AT_decl_column : 17
    <ee5>   DW_AT_type        : <0xaa8>
    <ee9>   DW_AT_data_member_location: 20
 <2><eea>: Abbrev Number: 3 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xbbe4d): CCMR1
    <eef>   DW_AT_decl_file   : 12
    <ef0>   DW_AT_decl_line   : 753
    <ef2>   DW_AT_decl_column : 17
    <ef3>   DW_AT_type        : <0xaa8>
    <ef7>   DW_AT_data_member_location: 24
 <2><ef8>: Abbrev Number: 3 (DW_TAG_member)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x5109e): CCMR2
    <efd>   DW_AT_decl_file   : 12
    <efe>   DW_AT_decl_line   : 754
    <f00>   DW_AT_decl_column : 17
    <f01>   DW_AT_type        : <0xaa8>
    <f05>   DW_AT_data_member_location: 28
 <2><f06>: Abbrev Number: 3 (DW_TAG_member)
    <f07>   DW_AT_name        : (indirect string, offset: 0x31a79): CCER
    <f0b>   DW_AT_decl_file   : 12
    <f0c>   DW_AT_decl_line   : 755
    <f0e>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0xaa8>
    <f13>   DW_AT_data_member_location: 32
 <2><f14>: Abbrev Number: 8 (DW_TAG_member)
    <f15>   DW_AT_name        : CNT
    <f19>   DW_AT_decl_file   : 12
    <f19>   DW_AT_decl_line   : 756
    <f1b>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0xaa8>
    <f1f>   DW_AT_data_member_location: 36
 <2><f20>: Abbrev Number: 8 (DW_TAG_member)
    <f21>   DW_AT_name        : PSC
    <f25>   DW_AT_decl_file   : 12
    <f25>   DW_AT_decl_line   : 757
    <f27>   DW_AT_decl_column : 17
    <f27>   DW_AT_type        : <0xaa8>
    <f2b>   DW_AT_data_member_location: 40
 <2><f2c>: Abbrev Number: 8 (DW_TAG_member)
    <f2d>   DW_AT_name        : ARR
    <f31>   DW_AT_decl_file   : 12
    <f31>   DW_AT_decl_line   : 758
    <f33>   DW_AT_decl_column : 17
    <f33>   DW_AT_type        : <0xaa8>
    <f37>   DW_AT_data_member_location: 44
 <2><f38>: Abbrev Number: 8 (DW_TAG_member)
    <f39>   DW_AT_name        : RCR
    <f3d>   DW_AT_decl_file   : 12
    <f3d>   DW_AT_decl_line   : 759
    <f3f>   DW_AT_decl_column : 17
    <f3f>   DW_AT_type        : <0xaa8>
    <f43>   DW_AT_data_member_location: 48
 <2><f44>: Abbrev Number: 3 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0x19206): CCR1
    <f49>   DW_AT_decl_file   : 12
    <f4a>   DW_AT_decl_line   : 760
    <f4c>   DW_AT_decl_column : 17
    <f4d>   DW_AT_type        : <0xaa8>
    <f51>   DW_AT_data_member_location: 52
 <2><f52>: Abbrev Number: 3 (DW_TAG_member)
    <f53>   DW_AT_name        : (indirect string, offset: 0x54fe3): CCR2
    <f57>   DW_AT_decl_file   : 12
    <f58>   DW_AT_decl_line   : 761
    <f5a>   DW_AT_decl_column : 17
    <f5b>   DW_AT_type        : <0xaa8>
    <f5f>   DW_AT_data_member_location: 56
 <2><f60>: Abbrev Number: 3 (DW_TAG_member)
    <f61>   DW_AT_name        : (indirect string, offset: 0x9d845): CCR3
    <f65>   DW_AT_decl_file   : 12
    <f66>   DW_AT_decl_line   : 762
    <f68>   DW_AT_decl_column : 17
    <f69>   DW_AT_type        : <0xaa8>
    <f6d>   DW_AT_data_member_location: 60
 <2><f6e>: Abbrev Number: 3 (DW_TAG_member)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xd41d): CCR4
    <f73>   DW_AT_decl_file   : 12
    <f74>   DW_AT_decl_line   : 763
    <f76>   DW_AT_decl_column : 17
    <f77>   DW_AT_type        : <0xaa8>
    <f7b>   DW_AT_data_member_location: 64
 <2><f7c>: Abbrev Number: 3 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x8c02d): BDTR
    <f81>   DW_AT_decl_file   : 12
    <f82>   DW_AT_decl_line   : 764
    <f84>   DW_AT_decl_column : 17
    <f85>   DW_AT_type        : <0xaa8>
    <f89>   DW_AT_data_member_location: 68
 <2><f8a>: Abbrev Number: 8 (DW_TAG_member)
    <f8b>   DW_AT_name        : DCR
    <f8f>   DW_AT_decl_file   : 12
    <f8f>   DW_AT_decl_line   : 765
    <f91>   DW_AT_decl_column : 17
    <f91>   DW_AT_type        : <0xaa8>
    <f95>   DW_AT_data_member_location: 72
 <2><f96>: Abbrev Number: 3 (DW_TAG_member)
    <f97>   DW_AT_name        : (indirect string, offset: 0xb0e88): DMAR
    <f9b>   DW_AT_decl_file   : 12
    <f9c>   DW_AT_decl_line   : 766
    <f9e>   DW_AT_decl_column : 17
    <f9f>   DW_AT_type        : <0xaa8>
    <fa3>   DW_AT_data_member_location: 76
 <2><fa4>: Abbrev Number: 8 (DW_TAG_member)
    <fa5>   DW_AT_name        : OR
    <fa8>   DW_AT_decl_file   : 12
    <fa8>   DW_AT_decl_line   : 767
    <faa>   DW_AT_decl_column : 17
    <faa>   DW_AT_type        : <0xaa8>
    <fae>   DW_AT_data_member_location: 80
 <2><faf>: Abbrev Number: 0
 <1><fb0>: Abbrev Number: 18 (DW_TAG_typedef)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x11c62d): TIM_TypeDef
    <fb5>   DW_AT_decl_file   : 12
    <fb6>   DW_AT_decl_line   : 768
    <fb8>   DW_AT_decl_column : 3
    <fb9>   DW_AT_type        : <0xe96>
 <1><fbd>: Abbrev Number: 25 (DW_TAG_structure_type)
    <fbe>   DW_AT_byte_size   : 28
    <fbf>   DW_AT_decl_file   : 12
    <fc0>   DW_AT_decl_line   : 774
    <fc2>   DW_AT_decl_column : 9
    <fc2>   DW_AT_sibling     : <0x101b>
 <2><fc6>: Abbrev Number: 8 (DW_TAG_member)
    <fc7>   DW_AT_name        : SR
    <fca>   DW_AT_decl_file   : 12
    <fca>   DW_AT_decl_line   : 776
    <fcc>   DW_AT_decl_column : 17
    <fcc>   DW_AT_type        : <0xaa8>
    <fd0>   DW_AT_data_member_location: 0
 <2><fd1>: Abbrev Number: 8 (DW_TAG_member)
    <fd2>   DW_AT_name        : DR
    <fd5>   DW_AT_decl_file   : 12
    <fd5>   DW_AT_decl_line   : 777
    <fd7>   DW_AT_decl_column : 17
    <fd7>   DW_AT_type        : <0xaa8>
    <fdb>   DW_AT_data_member_location: 4
 <2><fdc>: Abbrev Number: 8 (DW_TAG_member)
    <fdd>   DW_AT_name        : BRR
    <fe1>   DW_AT_decl_file   : 12
    <fe1>   DW_AT_decl_line   : 778
    <fe3>   DW_AT_decl_column : 17
    <fe3>   DW_AT_type        : <0xaa8>
    <fe7>   DW_AT_data_member_location: 8
 <2><fe8>: Abbrev Number: 8 (DW_TAG_member)
    <fe9>   DW_AT_name        : CR1
    <fed>   DW_AT_decl_file   : 12
    <fed>   DW_AT_decl_line   : 779
    <fef>   DW_AT_decl_column : 17
    <fef>   DW_AT_type        : <0xaa8>
    <ff3>   DW_AT_data_member_location: 12
 <2><ff4>: Abbrev Number: 8 (DW_TAG_member)
    <ff5>   DW_AT_name        : CR2
    <ff9>   DW_AT_decl_file   : 12
    <ff9>   DW_AT_decl_line   : 780
    <ffb>   DW_AT_decl_column : 17
    <ffb>   DW_AT_type        : <0xaa8>
    <fff>   DW_AT_data_member_location: 16
 <2><1000>: Abbrev Number: 8 (DW_TAG_member)
    <1001>   DW_AT_name        : CR3
    <1005>   DW_AT_decl_file   : 12
    <1005>   DW_AT_decl_line   : 781
    <1007>   DW_AT_decl_column : 17
    <1007>   DW_AT_type        : <0xaa8>
    <100b>   DW_AT_data_member_location: 20
 <2><100c>: Abbrev Number: 3 (DW_TAG_member)
    <100d>   DW_AT_name        : (indirect string, offset: 0xe14d5): GTPR
    <1011>   DW_AT_decl_file   : 12
    <1012>   DW_AT_decl_line   : 782
    <1014>   DW_AT_decl_column : 17
    <1015>   DW_AT_type        : <0xaa8>
    <1019>   DW_AT_data_member_location: 24
 <2><101a>: Abbrev Number: 0
 <1><101b>: Abbrev Number: 18 (DW_TAG_typedef)
    <101c>   DW_AT_name        : (indirect string, offset: 0xfeef3): USART_TypeDef
    <1020>   DW_AT_decl_file   : 12
    <1021>   DW_AT_decl_line   : 783
    <1023>   DW_AT_decl_column : 3
    <1024>   DW_AT_type        : <0xfbd>
 <1><1028>: Abbrev Number: 5 (DW_TAG_typedef)
    <1029>   DW_AT_name        : (indirect string, offset: 0xd1d6d): size_t
    <102d>   DW_AT_decl_file   : 13
    <102e>   DW_AT_decl_line   : 214
    <102f>   DW_AT_decl_column : 23
    <1030>   DW_AT_type        : <0xa5b>
 <1><1034>: Abbrev Number: 19 (DW_TAG_base_type)
    <1035>   DW_AT_byte_size   : 8
    <1036>   DW_AT_encoding    : 4	(float)
    <1037>   DW_AT_name        : (indirect string, offset: 0x4a012): long double
 <1><103b>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <103c>   DW_AT_encoding    : 7	(unsigned)
    <103d>   DW_AT_byte_size   : 1
    <103e>   DW_AT_type        : <0x9e2>
    <1042>   DW_AT_decl_file   : 14
    <1043>   DW_AT_decl_line   : 39
    <1044>   DW_AT_decl_column : 1
    <1045>   DW_AT_sibling     : <0x1062>
 <2><1049>: Abbrev Number: 1 (DW_TAG_enumerator)
    <104a>   DW_AT_name        : (indirect string, offset: 0x44d86): HAL_OK
    <104e>   DW_AT_const_value : 0
 <2><104f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1050>   DW_AT_name        : (indirect string, offset: 0x8055a): HAL_ERROR
    <1054>   DW_AT_const_value : 1
 <2><1055>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1056>   DW_AT_name        : (indirect string, offset: 0x2404a): HAL_BUSY
    <105a>   DW_AT_const_value : 2
 <2><105b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <105c>   DW_AT_name        : (indirect string, offset: 0x3bd1c): HAL_TIMEOUT
    <1060>   DW_AT_const_value : 3
 <2><1061>: Abbrev Number: 0
 <1><1062>: Abbrev Number: 5 (DW_TAG_typedef)
    <1063>   DW_AT_name        : (indirect string, offset: 0x2b29): HAL_StatusTypeDef
    <1067>   DW_AT_decl_file   : 14
    <1068>   DW_AT_decl_line   : 44
    <1069>   DW_AT_decl_column : 3
    <106a>   DW_AT_type        : <0x103b>
 <1><106e>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <106f>   DW_AT_encoding    : 7	(unsigned)
    <1070>   DW_AT_byte_size   : 1
    <1071>   DW_AT_type        : <0x9e2>
    <1075>   DW_AT_decl_file   : 14
    <1076>   DW_AT_decl_line   : 50
    <1077>   DW_AT_decl_column : 1
    <1078>   DW_AT_sibling     : <0x1089>
 <2><107c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <107d>   DW_AT_name        : (indirect string, offset: 0x98615): HAL_UNLOCKED
    <1081>   DW_AT_const_value : 0
 <2><1082>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1083>   DW_AT_name        : (indirect string, offset: 0xcdf67): HAL_LOCKED
    <1087>   DW_AT_const_value : 1
 <2><1088>: Abbrev Number: 0
 <1><1089>: Abbrev Number: 5 (DW_TAG_typedef)
    <108a>   DW_AT_name        : (indirect string, offset: 0x78e9b): HAL_LockTypeDef
    <108e>   DW_AT_decl_file   : 14
    <108f>   DW_AT_decl_line   : 53
    <1090>   DW_AT_decl_column : 3
    <1091>   DW_AT_type        : <0x106e>
 <1><1095>: Abbrev Number: 23 (DW_TAG_structure_type)
    <1096>   DW_AT_byte_size   : 28
    <1097>   DW_AT_decl_file   : 15
    <1098>   DW_AT_decl_line   : 45
